:SETUP:
#+TITLE: Comparing Cash and Asset Transfers to Low-Income Households in South Sudan
#+AUTHOR: Reajul Chowdhury, Elliott Collins, Ethan Ligon, Munshi Sulaiman
#+DATE: \today
#+BIBLIOGRAPHY: main chicago
#+OPTIONS: texht:t toc:nil ':t inline:nil todo:nil
#+OPTIONS: title:nil  author:nil
#+LATEX_CLASS_OPTIONS: [12pt,letterpaper]
#+LATEX_HEADER: \usepackage{amsaddr}
#+LATEX_HEADER:       \newcommand{\Eq}[1]{(\ref{eq:#1})}
#+LaTeX_HEADER:       \usepackage[T1]{fontenc}
#+LATEX_HEADER_EXTRA: \newcommand{\Fig}[1]{Figure \ref{fig:#1}} \newcommand{\Tab}[1]{Table \ref{tab:#1}}
#+LATEX_HEADER_EXTRA: \usepackage{stringstrings} \renewcommand{\cite}[1]{\caselower[q]{#1}\citet{\thestring}}
#+LATEX_HEADER_EXTRA: \usepackage{lscape}
#+LATEX_HEADER_EXTRA: \usepackage{changepage}
#+LATEX_HEADER_EXTRA: \usepackage{fullpage}
#+LATEX_HEADER_EXTRA: \addbibresource{~/bibtex/main.bib}
#+PROPERTY: header-args:python :results output raw table :noweb no-export :exports none :prologue "# -*- coding: utf-8 -*-"
:END:

**** Creating a new attrition balance table with only nonzero values counting toward the mean :noexport:

 The following table shows the means of log expenditures. 

 #+name: attrition_balance_nonzero
 #+begin_src python :noweb no-export :exports none  :results output table raw labels=[] :colnames no
data_baseline  = "../../TUP-data/data/Baseline/UPG_baseline.dta"
data_midline  = "../..//TUP-data/Midline/UPG_midline.dta"
data_endline = "../..//TUP-data/Endline/UPG_endline.dta"
data_assignment  = "../../Report/documents/master_assignment.csv"
import pandas as pd
import numpy as np
from scipy import stats
from cfe.df_utils import df_to_orgtbl

df_b = pd.read_stata(data_baseline)
df_m = pd.read_stata(data_midline)
df_e = pd.read_stata(data_endline)
df_a = pd.read_csv(data_assignment)

df_m.insert(len(df_m.columns), 'in_midline', 1)
df_e.insert(len(df_e.columns), 'in_endline', 1)

df = pd.merge(df_b, df_a[ ['RespID', 'Group'] ], how='outer', left_on="idno", right_on="RespID")

# merge in midline and endline
df = pd.merge(df, df_m[ ['idno', 'in_midline'] ], how='outer', left_on="idno", right_on="idno")
df = pd.merge(df, df_e[ ['idno', 'in_endline'] ], how='outer', left_on='idno', right_on='idno')

df['in_midline'].fillna(value=0, inplace=True)
df['in_endline'].fillna(value=0, inplace=True)

df_3_days = df[ ['c_meat_b', 'c_fish_b', 'c_cereals_b', 'c_sugar_b', 'c_egg_b', 'c_oil_b', 'c_beans_b', \
                    'c_fruit_b', 'c_salt_b', 'c_vegetables_b', \
                    'c_milk_b', 'c_spices_b', 'c_alcohol_b', 'c_otherfood_b'] ]

df_month = df[ ['c_fuel_b', 'c_soap_b', 'c_transport_b', 'c_cosmetics_b', 'c_entertainment_b'] ]

df_year = df[ ['c_clothesfootwear_b', 'c_charities_b', 'c_ceremonies_b', 'c_textiles_b', 'c_utensils_b',
                  'c_dowry_b', 'c_furniture_b', 'c_other_b'] ]

df_assets = df.get(['asset_val_cows_b', 'asset_val_smallanimals_b', 'asset_val_bicycle_b', 'asset_val_radio_b',
             'asset_val_motorcycle_b', 'asset_val_net_b', 'asset_val_poultry_b',
             'asset_val_bed_b', 'asset_val_chairtables_b', 'asset_val_mobile_b',
             'asset_val_netITN_b',
             'asset_n_house_b', 'child_total_b', 'hh_size_b'])

df_1 = df_3_days.join(df_month.join(df_year.join(df_assets)))
df_1.replace(to_replace = 0, value = float("NaN") , inplace = True)

# take the logs of expenditure for all variables except dummy variables
df_1 = df_1.transform(lambda x: np.log(x))

# add in group assignment and the dummy variables that need 0 as one of their values
df_1 = df_1.join(df[ ['in_midline', 'in_endline', 'in_business_b', 'Group'] ])

means_b = df_1.mean()
means_m = df_1.groupby(['in_midline']).mean()
means_e = df_1.groupby(['in_endline']).mean()
means_b = means_b.T
means_m = means_m.T
means_e = means_e.T

d = {'mean_baseline': means_b, 'beta_mid': means_m[1.0] - means_m[0.0], 'beta_end': means_e[1.0] - means_e[0.0]}
means = pd.DataFrame(data=d)

#default axis=0 for dropping rows
means.drop(['in_midline', 'in_endline'], inplace=True)

# so we can add * later
means = means.round(decimals = 3)
means = means.astype(str)

column_list = ['c_meat_b', 'c_fish_b', 'c_cereals_b', 'c_sugar_b', 'c_egg_b', 'c_oil_b', 'c_beans_b', \
                    'c_fruit_b', 'c_salt_b', 'c_vegetables_b', \
                    'c_milk_b', 'c_spices_b', 'c_alcohol_b', 'c_otherfood_b', \
              'c_fuel_b', 'c_soap_b', 'c_transport_b', 'c_cosmetics_b', 'c_entertainment_b', \
               'c_clothesfootwear_b', 'c_charities_b', 'c_ceremonies_b', 'c_textiles_b', 'c_utensils_b',
                  'c_dowry_b', 'c_furniture_b', 'c_other_b', \
              'asset_val_cows_b', 'asset_val_smallanimals_b', 'asset_val_bicycle_b', 'asset_val_radio_b', \
             'asset_val_motorcycle_b', 'asset_val_net_b', 'asset_val_poultry_b', \
             'asset_val_bed_b', 'asset_val_chairtables_b', 'asset_val_mobile_b', \
             'asset_val_netITN_b', \
             'asset_n_house_b', 'in_business_b', 'child_total_b', 'hh_size_b']

for column in column_list:
    
    pvalue_mid = stats.ttest_ind(df_1[df_1['in_midline'] == 1][column], df_1[df_1['in_midline'] == 0][column], nan_policy='omit').pvalue
    
    if pvalue_mid <= 0.01: 
        means.at[column,'beta_mid'] = means.at[column,'beta_mid'] + '***'
    elif pvalue_mid <= 0.05: 
        means.at[column,'beta_mid'] = means.at[column,'beta_mid'] + '**'
    elif pvalue_mid <= 0.1: 
        means.at[column,'beta_mid'] = means.at[column,'beta_mid'] + '*'
        
    pvalue_end = stats.ttest_ind(df_1[df_1['in_endline'] == 1][column], df_1[df_1['in_endline'] == 0][column], nan_policy='omit').pvalue
    
    if pvalue_end <= 0.01: 
        means.at[column,'beta_end'] = means.at[column,'beta_end'] + '***'
    elif pvalue_end <= 0.05: 
        means.at[column,'beta_end'] = means.at[column,'beta_end'] + '**'
    elif pvalue_end <= 0.1: 
        means.at[column,'beta_end'] = means.at[column,'beta_end'] + '*'

# label the rows using "Better Var Name" in UPG-data/ssudan_survey.org
means.rename({'c_meat_b': ' Meat (last three days)', 'c_fish_b': 'Fish (last three days)', 
            'c_cereals_b': 'Cereals (last three days)', 'c_sugar_b': 'Sugar (last three days)', 
            'c_egg_b': 'Egg (last three days)', 'c_oil_b': 'Oil (last three days)', 
            'c_beans_b': 'Beans (last three days)', 'c_fruit_b': 'Fruit (last three days)', 
            'c_salt_b': 'Salt (last three days)', 'c_vegetables_b': 'Vegetables (last three days)', 
            'c_milk_b': 'Milk (last three days)', 'c_spices_b': 'Spices (last three days)', 
            'c_alcohol_b': 'Alcohol (last three days)', 'c_otherfood_b': 'Other food (last three days)', 
            'c_fuel_b': 'Cooking fuel (last month)', 'c_soap_b': 'Toiletries (last month)', 
            'c_transport_b': 'Transportation (last month)', 'c_cosmetics_b': 'Cosmetics (last month)', 
            'c_entertainment_b': 'Entertainment (last month)', 'c_clothesfootwear_b': 'Clothing, footwear (last year)', 
            'c_charities_b': 'Charities (last year)', 'c_ceremonies_b': 'Rituals/ceremonies (last year)', 
            'c_textiles_b': 'Textiles (last year)', 'c_utensils_b': 'Utensils (last year)',
            'c_dowry_b': 'Dowry (last year)', 'c_furniture_b': 'Furniture (last year)', 
            'c_other_b': 'Other non-food (last year)', 'asset_val_cows_b': 'Large livestock (cows)', 
            'asset_val_smallanimals_b': 'Small livestock', 'asset_val_bicycle_b': 'Bicycle', 
            'asset_val_radio_b': 'Radio', 'asset_val_motorcycle_b': 'Motorcycle', 
            'asset_val_net_b': 'Mosquito net', 'asset_val_poultry_b': 'Poultry', 
            'asset_val_bed_b': 'Bed', 'asset_val_chairtables_b': 'Chair/table', 
            'asset_val_mobile_b': 'Mobile phone', 'asset_val_netITN_b': 'Mosquito net ITN', 
            'asset_n_house_b': '# Houses', 'in_business_b': 'In business', 
            'child_total_b': '# Child', 'hh_size_b':'Household size'}, inplace=True)

newdf = df_to_orgtbl(means, float_fmt = '%.3f')

print(newdf)


 #+end_src

 #+RESULTS: attrition_balance_nonzero
 |                                | mean_baseline |  beta_mid | beta_end |
 |--------------------------------+---------------+-----------+----------|
 | # Houses                       |         1.054 |     0.083 |    0.071 |
 | Bed                            |         5.328 |     0.028 | -0.408** |
 | Bicycle                        |         5.642 |     0.106 |    0.015 |
 | Chair/table                    |         4.902 |     0.179 |   -0.224 |
 | Large livestock (cows)         |         7.428 |     0.686 |    0.133 |
 | Mobile phone                   |         4.862 |     0.075 |   -0.174 |
 | Motorcycle                     |         7.223 |     0.918 |    0.787 |
 | Mosquito net ITN               |         3.151 |     0.034 |   -0.324 |
 | Mosquito net                   |         3.096 |     0.009 |    0.056 |
 | Poultry                        |         4.582 |     0.259 |    0.111 |
 | Radio                          |         4.314 |    -0.036 |   -0.354 |
 | Small livestock                |          6.29 |     0.351 |    0.081 |
 | Alcohol (last three days)      |         1.367 |    -0.272 |   0.633* |
 | Beans (last three days)        |         1.746 |      0.3* |   -0.272 |
 | Cereals (last three days)      |         3.003 |    -0.052 |  -0.255* |
 | Rituals/ceremonies (last year) |          4.54 |    -0.139 |   -0.085 |
 | Charities (last year)          |         3.237 |    -0.241 |    0.076 |
 | Clothing, footwear (last year) |         4.973 |    0.234* |   -0.169 |
 | Cosmetics (last month)         |          2.68 |     -0.03 |    0.062 |
 | Dowry (last year)              |         6.103 |     0.596 |    0.122 |
 | Egg (last three days)          |         1.797 |    -0.081 |    0.076 |
 | Entertainment (last month)     |         2.033 |    -0.116 |    0.418 |
 | Fish (last three days)         |         2.069 |       0.0 |    0.028 |
 | Fruit (last three days)        |         1.337 |     0.094 |   -0.114 |
 | Cooking fuel (last month)      |         2.912 |     0.033 |   -0.257 |
 | Furniture (last year)          |         4.273 |     0.041 |   -0.338 |
 | Meat (last three days)         |         2.859 |     0.133 |    0.105 |
 | Milk (last three days)         |         2.461 |     0.193 |    0.175 |
 | Oil (last three days)          |         0.896 |    -0.054 |   -0.216 |
 | Other non-food (last year)     |           nan |       nan |      nan |
 | Other food (last three days)   |           nan |       nan |      nan |
 | Salt (last three days)         |          0.18 | -0.154*** |   -0.053 |
 | Toiletries (last month)        |         2.276 |     -0.17 |   -0.086 |
 | Spices (last three days)       |         0.792 |     -0.19 |   -0.156 |
 | Sugar (last three days)        |         1.317 |    -0.092 |   -0.116 |
 | Textiles (last year)           |         4.137 |     0.099 |   -0.109 |
 | Transportation (last month)    |         2.417 |    -0.132 |    0.022 |
 | Utensils (last year)           |         4.347 |      0.21 |    -0.24 |
 | Vegetables (last three days)   |         1.514 |     0.095 |   -0.047 |
 | # Child                        |         1.142 |  0.219*** |   0.173* |
 | Household size                 |         1.919 |   0.081** |    0.062 |
 | In business                    |         0.415 |     0.038 |    0.007 |



* Omnibus Analysis                                                 :noexport:

Here we consider the most straight-forward possible comparison of
programs.  Instead of the aggregation which characterizes many of our
main results, we collect a list of all the primitive variables
collected in our surveys for which we'd expect simply estimate conduct a POST analysis on /all/ of the
outcomes which inform those aggregations, without any transformation
or modification.
#+begin_src python :results output raw table :tangle /tmp/post.py
import ss_standard
import pandas as pd
from cfe.df_utils import drop_missing, df_to_orgtbl
import statsmodels.api as sm
import numpy as np
from  scipy import stats

prettylabels = {'meat': ' Meat (last three days)', 'fish': 'Fish (last three days)', 
                'cereals': 'Cereals (last three days)', 'sugar': 'Sugar (last three days)', 
                'egg': 'Egg (last three days)', 'oil': 'Oil (last three days)', 
                'beans': 'Beans (last three days)', 'fruit': 'Fruit (last three days)', 
                'salt': 'Salt (last three days)', 'vegetables': 'Vegetables (last three days)', 
                'milk': 'Milk (last three days)', 'spices': 'Spices (last three days)', 
                'alcohol': 'Alcohol (last three days)', 'otherfood': 'Other food (last three days)', 
                'fuel': 'Cooking fuel (last month)', 'soap': 'Toiletries (last month)', 
                'transport': 'Transportation (last month)', 'cosmetics': 'Cosmetics (last month)', 
                'entertainment': 'Entertainment (last month)', 'clothesfootwear': 'Clothing, footwear (last year)', 
                'charities': 'Charities (last year)', 'ceremonies': 'Rituals/ceremonies (last year)', 
                'textiles': 'Textiles (last year)', 'utensils': 'Utensils (last year)',
                'dowry': 'Dowry (last year)', 'furniture': 'Furniture (last year)', 
                'other': 'Other non-food (last year)', 'cows': 'Large livestock (cows)', 
                'smallanimals': 'Small livestock', 'bicycle': 'Bicycle', 
                'radio': 'Radio', 'motorcycle': 'Motorcycle', 
                'net': 'Mosquito net', 'poultry': 'Poultry', 
                'bed': 'Bed', 'chairtables': 'Chair/table', 
                'mobile': 'Mobile phone', 'netITN': 'Mosquito net ITN', 
                'in_business': 'In business', 
                'child_total': '# Child', 'hh_size':'Household size'}

assets = ss_standard.basic_data(outcomes=None,filter='^asset_val_')
assets = assets.rename(columns={'poultry':'Poultry (birds)'})

savings = ss_standard.basic_data(outcomes=['savings_home', 'savings_bank', 'savings_BRAC', 'savings_NGOs', 
                                           'savings_other',  'transfers_give1', 'transfers_give2', 'transfers_give3',
                                           'savings_maize_val', 'savings_sorghum_val', 's8b_2c', 's8b_2d',
                                           's4b_oth_1b', 's4b_oth_2b','savings_otherfood1_val','savings_otherfood2_val'])


savings.rename({'s8b_2c': 'savings_otherfood1_val',
                's8b_2d': 'savings_otherfood2_val',
                's4b_oth_1b': 'savings_otherfood1_val',
                's4b_oth_2b': 'savings_otherfood2_val'}, axis=1, inplace=True)

savings = savings.groupby(level=0,axis=1).sum()

land = ss_standard.basic_data(outcomes=['land_owncult', 'land_rentcult', 'land_communitycult',
                                        'land_ownnocult', 'land_ownrent'])


# Issue that units are supposed to be fedan (4200 m^2), but are sometimes instead expressed in square meters (20mx20m plots)
for v in ['land_owncult', 'land_rentcult', 'land_communitycult', 'land_ownnocult', 'land_ownrent']:
        land[v].loc[land[v]>20] = land[v].loc[land[v]>20]/4200

consumption = ss_standard.basic_data(filter = r'^c_')

fs = ss_standard.basic_data(filter = r'^fs_')

# replace words with estimate of days per month not hungry
fs.replace({"Everyday": 0,
            "everyday": 0,
            "3-6 times a week": 28-4.5*4,
            "1-2 times a week": 28-1.5*4,
            "Less than once a week": 28-4,
            "less than once a week": 28-4,
            "Never": 28,
            "never": 28}, inplace=True)


outcomes = {'worried':'Worried', 
            'notpreferred':'No preferred',
            'fewkinds':'Few kinds',
            'preferrednot':'Ate unpreferred',
            'portions':'Limited portions',
            'fewmeals':'Fewer Meals', 
            'nofood':'No food in house', 
            'hungry':'Went hungry', 
            'wholeday':'Whole day without eating'}

fs = fs.rename(columns=outcomes)

from income import farm_yearly, nonfarm_yearly

nonfarm_yearly['Year'] = '2015'
nonfarm_yearly = nonfarm_yearly.groupby(['idno','Year']).sum()


farm_yearly['Year'] = '2015'
farm_yearly = farm_yearly.groupby(['idno','Year']).sum()


df = pd.concat({'Farm Income':farm_yearly,
                'Nonfarm Income':nonfarm_yearly,
                'Food Security':fs,
                'Consumption':consumption,
                'Land':land,
                'Savings':savings,
                'Physical Assets':assets},axis=1)

df = pd.concat([farm_yearly,
                nonfarm_yearly,
                fs,
                consumption,
                land,
                savings,
                assets],axis=1).rename(columns=prettylabels)

df = df.loc[:,~df.columns.duplicated(keep='first')]

group = df['Group']
groups = pd.get_dummies(group)
# Drop Group vars
df = df.loc[:,[s for s in df.columns if 'Group' not in s]]

df = df.loc[:,df.std()>0]
outcomes = df.columns.tolist()

#df = pd.concat([df,groups],axis=1)
df['Group'] = group  # Ancova
df = ss_standard.ancova_form(df,outcomes)

Residuals = ss_standard.residuals(df,outcomes)
Residuals = Residuals.join(group).reset_index().set_index(['idno','Year','Group'])
Residuals.to_pickle('/tmp/residuals.pickle')

Results = {}

Results['Values (SSP)'] = ss_standard.results(df,outcomes,nonzero=False,logs=False,return_stats=True)
Results['Nonzero'] = ss_standard.results(df,outcomes,nonzero=True,logs=False,return_stats=True)
Results['Log Values'] = ss_standard.results(df,outcomes,nonzero=False,logs=True,return_stats=True)

other = pd.DataFrame({k:r[2].stack() for k,r in Results.items()})
other.index.names = ['Variable','Outcome']
other.columns.name = 'Class'
other = other.stack().unstack('Variable').reorder_levels(['Class','Outcome']).sort_index()
other = other.reindex(['Values (SSP)','Nonzero','Log Values'],level=0)

# binomial test
ptab = {}
countsplus = {}
countsminus = {}
for sort in Results.keys():
    plus = (Results[sort][0].T>0).sum()
    minus = (Results[sort][0].T<0).sum()
    countsplus[sort] = plus
    countsminus[sort] = minus
    plus = plus.to_dict()
    minus = minus.to_dict()
    ptab[sort] = {k:stats.binom_test((plus[k],minus[k]),alternative='greater') for k in plus.keys() if r'$\beta' in k}

countsplus = pd.DataFrame(countsplus).T.filter(like='beta')
countsminus = pd.DataFrame(countsminus).T.filter(like='beta')

ptab = pd.DataFrame(ptab).T

print(df_to_orgtbl(np.round(ptab,decimals=3).astype(str),
                   conf_ints=(countsplus.astype(str),countsminus.astype(str)),float_fmt=r'%s'))

print(ss_standard.table_stacked_by_class(Results,elide=True))

#print(ss_standard.table_stacked_by_class(Results,elide=False))
#+end_src 

#+results:
| Class        | Outcome   | $\beta_{UPG}$    | $\beta_{UCT}$    | $\beta_{UPG}-\beta_{UCT}$ |
|--------------+-----------+------------------+------------------+---------------------------|
| Values (SSP) | Farm      | \(-137.54\)      | \( 59.68\)       | \(-197.22\)               |
|              | $N=522$   | (\( 98.52\))     | (\(138.06\))     | (\(169.61\))              |
|              | Livestock | \(474.63\)^{***} | \(  4.36\)       | \(470.27\)^{**}           |
|              | $N=522$   | (\(140.49\))     | (\(128.82\))     | (\(190.61\))              |
|              | Non-Farm  | \(994.62\)       | \(721.94\)       | \(272.68\)                |
|              | $N=631$   | (\(1039.44\))    | (\(1121.48\))    | (\(1529.10\))             |
|              | Total     | \(1250.46\)      | \(658.11\)       | \(592.35\)                |
|              | $N=664$   | (\(1010.21\))    | (\(1064.06\))    | (\(1467.22\))             |
| Nonzero      | Farm      | \( -0.00\)       | \(  0.01\)       | \( -0.01\)                |
|              | $N=522$   | (\(  0.01\))     | (\(  0.01\))     | (\(  0.01\))              |
|              | Livestock | \(  0.40\)^{***} | \(  0.18\)^{***} | \(  0.22\)^{***}          |
|              | $N=522$   | (\(  0.04\))     | (\(  0.06\))     | (\(  0.08\))              |
|              | Non-Farm  | \(  0.05\)       | \(  0.06\)       | \( -0.01\)                |
|              | $N=631$   | (\(  0.03\))     | (\(  0.04\))     | (\(  0.05\))              |
|              | Total     | \(  0.03\)^{**}  | \(  0.00\)       | \(  0.03\)                |
|              | $N=664$   | (\(  0.01\))     | (\(  0.02\))     | (\(  0.03\))              |
| Log Values   | Farm      | \( -0.15\)       | \(  0.01\)       | \( -0.16\)                |
|              | $N=518$   | (\(  0.12\))     | (\(  0.17\))     | (\(  0.20\))              |
|              | Livestock | \(  0.53\)^{***} | \( -0.07\)       | \(  0.60\)^{**}           |
|              | $N=296$   | (\(  0.16\))     | (\(  0.23\))     | (\(  0.28\))              |
|              | Non-Farm  | \( -0.12\)       | \( -0.26\)       | \(  0.14\)                |
|              | $N=538$   | (\(  0.12\))     | (\(  0.18\))     | (\(  0.22\))              |
|              | Total     | \(  0.15\)       | \( -0.04\)       | \(  0.19\)                |
|              | $N=645$   | (\(  0.11\))     | (\(  0.16\))     | (\(  0.20\))              |

| Class        | Outcome   | $\beta_{UPG}$    | $\beta_{UCT}$    | Constant          | $\beta_{UPG}-\beta_{UCT}$ |
|--------------+-----------+------------------+------------------+-------------------+---------------------------|
| Values (SSP) | Farm      | \(-137.54\)      | \( 59.68\)       | \(905.67\)^{***}  | \(-197.22\)               |
|              | $N=522$   | (\( 98.52\))     | (\(138.06\))     | (\( 71.24\))      | (\(169.61\))              |
|              | Livestock | \(474.63\)^{***} | \(  4.36\)       | \(368.42\)^{***}  | \(470.27\)^{**}           |
|              | $N=522$   | (\(140.49\))     | (\(128.82\))     | (\( 88.23\))      | (\(190.61\))              |
|              | Non-Farm  | \(994.62\)       | \(721.94\)       | \(3630.45\)^{***} | \(272.68\)                |
|              | $N=631$   | (\(1039.44\))    | (\(1121.48\))    | (\(287.45\))      | (\(1529.10\))             |
|              | Total     | \(1250.46\)      | \(658.11\)       | \(4450.79\)^{***} | \(592.35\)                |
|              | $N=664$   | (\(1010.21\))    | (\(1064.06\))    | (\(302.38\))      | (\(1467.22\))             |
| Nonzero      | Farm      | \( -0.00\)       | \(  0.01\)       | \(  0.99\)^{***}  | \( -0.01\)                |
|              | $N=522$   | (\(  0.01\))     | (\(  0.01\))     | (\(  0.01\))      | (\(  0.01\))              |
|              | Livestock | \(  0.40\)^{***} | \(  0.18\)^{***} | \(  0.40\)^{***}  | \(  0.22\)^{***}          |
|              | $N=522$   | (\(  0.04\))     | (\(  0.06\))     | (\(  0.03\))      | (\(  0.08\))              |
|              | Non-Farm  | \(  0.05\)       | \(  0.06\)       | \(  0.83\)^{***}  | \( -0.01\)                |
|              | $N=631$   | (\(  0.03\))     | (\(  0.04\))     | (\(  0.02\))      | (\(  0.05\))              |
|              | Total     | \(  0.03\)^{**}  | \(  0.00\)       | \(  0.96\)^{***}  | \(  0.03\)                |
|              | $N=664$   | (\(  0.01\))     | (\(  0.02\))     | (\(  0.01\))      | (\(  0.03\))              |
| Log Values   | Farm      | \( -0.15\)       | \(  0.01\)       | \(  6.18\)^{***}  | \( -0.16\)                |
|              | $N=518$   | (\(  0.12\))     | (\(  0.17\))     | (\(  0.08\))      | (\(  0.20\))              |
|              | Livestock | \(  0.53\)^{***} | \( -0.07\)       | \(  5.84\)^{***}  | \(  0.60\)^{**}           |
|              | $N=296$   | (\(  0.16\))     | (\(  0.23\))     | (\(  0.14\))      | (\(  0.28\))              |
|              | Non-Farm  | \( -0.12\)       | \( -0.26\)       | \(  7.76\)^{***}  | \(  0.14\)                |
|              | $N=538$   | (\(  0.12\))     | (\(  0.18\))     | (\(  0.08\))      | (\(  0.22\))              |
|              | Total     | \(  0.15\)       | \( -0.04\)       | \(  7.79\)^{***}  | \(  0.19\)                |
|              | $N=645$   | (\(  0.11\))     | (\(  0.16\))     | (\(  0.07\))      | (\(  0.20\))              |

|  | $\beta_{UPG}^{2014}$|   $\beta_{UPG}^{2015}$|   $\beta_{UCT}^{2014}$|   $\beta_{UCT}^{2015}$|   $\beta_{UPG}^{2014} - \beta_{UCT}^{2015}$|   $\beta_{UPG}^{2015} - \beta_{UCT}^{2015}$  |
|-
| Values (SSP)  | 0.0 | 0.034 | 0.979 | 0.281 | 0.0 | 0.074 |
|  | [76,24]    | [64,44]    | [44,64]    | [57,50]    | [72,36]    | [62,46]  |
| Nonzero  | 0.006 | 0.315 | 0.75 | 0.281 | 0.193 | 0.614 |
|  | [63,37]    | [57,51]    | [51,57]    | [57,50]    | [59,49]    | [53,55]  |
| Log Values  | 0.0 | 0.072 | 0.838 | 0.275 | 0.001 | 0.103 |
|  | [69,29]    | [61,45]    | [47,56]    | [54,47]    | [69,36]    | [60,46]  |

| Class | Outcome | $\beta_{UPG}^{2014}$|   $\beta_{UPG}^{2015}$|   $\beta_{UCT}^{2014}$|   $\beta_{UCT}^{2015}$|   $\beta_{UPG}^{2014} - \beta_{UCT}^{2015}$|   $\beta_{UPG}^{2015} - \beta_{UCT}^{2015}$  |
|-
| Values (SSP) |  Meat (last three days) | \(  2.39\)^{*}  | \(  2.09\)  | \( -0.25\)  | \(  3.23\)  | \( -0.84\)  | \( -1.14\)  |
 |  | $N=1306$  | (\(  1.41\))    | (\(  1.48\))    | (\(  1.34\))    | (\(  2.15\))    | (\(  2.57\))    | (\(  2.61\))  |
| | Alcohol (last three days) | \(  0.33\)^{*}  | \(  0.11\)^{*}  | \(  0.27\)  | \(  0.08\)  | \(  0.25\)  | \(  0.03\)  |
 |  | $N=1285$  | (\(  0.19\))    | (\(  0.06\))    | (\(  0.23\))    | (\(  0.08\))    | (\(  0.20\))    | (\(  0.10\))  |
| | Ate unpreferred | \( -0.41\)  | \(  0.32\)  | \(  1.61\)^{*}  | \( -1.16\)  | \(  0.75\)  | \(  1.49\)  |
 |  | $N=1297$  | (\(  0.73\))    | (\(  0.67\))    | (\(  0.82\))    | (\(  0.92\))    | (\(  1.18\))    | (\(  1.14\))  |
| | Beans (last three days) | \(  0.72\)^{**}  | \(  0.35\)  | \( -0.23\)  | \(  0.58\)  | \(  0.14\)  | \( -0.24\)  |
 |  | $N=1285$  | (\(  0.33\))    | (\(  0.68\))    | (\(  0.36\))    | (\(  0.93\))    | (\(  0.98\))    | (\(  1.15\))  |
| | Bed | \( 56.97\)^{*}  | \(  9.21\)  | \( 20.58\)  | \(-69.79\)^{***}  | \(126.76\)^{***}  | \( 79.00\)^{**}  |
 |  | $N=1306$  | (\( 33.59\))    | (\( 23.63\))    | (\( 35.33\))    | (\( 25.69\))    | (\( 42.29\))    | (\( 34.90\))  |
| | Bicycle | \(  8.97\)  | \( -7.89\)  | \( -2.94\)  | \( -9.34\)  | \( 18.32\)  | \(  1.45\)  |
 |  | $N=1306$  | (\( 17.14\))    | (\( 11.07\))    | (\( 19.45\))    | (\( 13.80\))    | (\( 22.00\))    | (\( 17.69\))  |
| | Cereals (last three days) | \(  6.25\)^{***}  | \(  0.00\)  | \( -2.33\)  | \(  3.78\)  | \(  2.47\)  | \( -3.78\)  |
 |  | $N=1306$  | (\(  1.88\))    | (\(  2.53\))    | (\(  2.08\))    | (\(  3.34\))    | (\(  3.83\))    | (\(  4.19\))  |
| | Chair/table | \( 25.51\)  | \( 12.92\)  | \(-20.58\)  | \(-23.55\)  | \( 49.06\)^{**}  | \( 36.47\)  |
 |  | $N=1306$  | (\( 17.51\))    | (\( 17.08\))    | (\( 17.14\))    | (\( 16.27\))    | (\( 23.90\))    | (\( 23.59\))  |
| | Charities (last year) | \(  6.93\)^{***}  | \(  0.00\)^{**}  | \(  2.53\)  | \( -0.00\)  | \(  6.93\)^{***}  | \(  0.00\)^{**}  |
 |  | $N=606$  | (\(  2.09\))    | (\(  0.00\))    | (\(  2.45\))    | (\(  0.00\))    | (\(  2.09\))    | (\(  0.00\))  |
| | Clothing, footwear (last year) | \( 11.68\)  | \( 18.60\)  | \(-34.21\)  | \(-24.51\)  | \( 36.19\)  | \( 43.11\)  |
 |  | $N=1306$  | (\( 26.79\))    | (\( 45.98\))    | (\( 30.47\))    | (\( 53.23\))    | (\( 59.60\))    | (\( 70.34\))  |
| | Cooking fuel (last month) | \(  2.25\)  | \(  0.33\)  | \( -4.27\)  | \(  0.14\)  | \(  2.11\)  | \(  0.19\)  |
 |  | $N=1306$  | (\(  3.62\))    | (\(  2.97\))    | (\(  4.17\))    | (\(  4.15\))    | (\(  5.51\))    | (\(  5.10\))  |
| | Cosmetics (last month) | \(  2.60\)^{*}  | \(  0.59\)  | \( -1.29\)  | \( -0.55\)  | \(  3.15\)  | \(  1.14\)  |
 |  | $N=1306$  | (\(  1.33\))    | (\(  2.01\))    | (\(  1.26\))    | (\(  2.24\))    | (\(  2.61\))    | (\(  3.01\))  |
| | Dowry (last year) | \(266.93\)  | \(  0.04\)  | \(-139.68\)  | \(-97.27\)^{***}  | \(364.20\)^{**}  | \( 97.31\)  |
 |  | $N=1306$  | (\(170.46\))    | (\( 51.70\))    | (\( 86.06\))    | (\( 33.15\))    | (\(173.66\))    | (\( 61.41\))  |
| | Egg (last three days) | \(  0.27\)  | \(  0.09\)  | \( -0.04\)  | \( -0.05\)  | \(  0.32\)  | \(  0.14\)  |
 |  | $N=1285$  | (\(  0.23\))    | (\(  0.21\))    | (\(  0.26\))    | (\(  0.25\))    | (\(  0.34\))    | (\(  0.33\))  |
| | Entertainment (last month) | \(  0.02\)  | \( -0.06\)  | \( -0.23\)  | \( -0.08\)  | \(  0.09\)  | \(  0.02\)  |
 |  | $N=1306$  | (\(  0.25\))    | (\(  0.07\))    | (\(  0.30\))    | (\(  0.07\))    | (\(  0.26\))    | (\(  0.10\))  |
| | Few kinds | \( -1.02\)  | \( -0.71\)  | \(  0.39\)  | \( -1.40\)  | \(  0.38\)  | \(  0.69\)  |
 |  | $N=1297$  | (\(  0.73\))    | (\(  0.71\))    | (\(  0.90\))    | (\(  0.94\))    | (\(  1.19\))    | (\(  1.18\))  |
| | Fewer Meals | \( -0.16\)  | \( -0.91\)  | \(  0.27\)  | \(  0.04\)  | \( -0.20\)  | \( -0.94\)  |
 |  | $N=1297$  | (\(  0.65\))    | (\(  0.65\))    | (\(  0.76\))    | (\(  0.81\))    | (\(  1.04\))    | (\(  1.04\))  |
| | Fish (last three days) | \(  1.22\)^{***}  | \( -1.40\)^{**}  | \(  0.47\)  | \( -0.24\)  | \(  1.45\)  | \( -1.17\)  |
 |  | $N=1285$  | (\(  0.43\))    | (\(  0.59\))    | (\(  0.50\))    | (\(  0.79\))    | (\(  0.90\))    | (\(  0.98\))  |
| | Fruit (last three days) | \(  0.25\)^{*}  | \( -0.06\)  | \(  0.23\)  | \(  0.20\)  | \(  0.05\)  | \( -0.25\)  |
 |  | $N=1285$  | (\(  0.14\))    | (\(  0.19\))    | (\(  0.18\))    | (\(  0.26\))    | (\(  0.30\))    | (\(  0.32\))  |
| | Furniture (last year) | \( 39.28\)^{**}  | \( -2.86\)  | \( 28.86\)  | \( -4.46\)  | \( 43.74\)^{**}  | \(  1.60\)  |
 |  | $N=1306$  | (\( 16.74\))    | (\(  2.56\))    | (\( 17.91\))    | (\(  3.53\))    | (\( 17.11\))    | (\(  4.36\))  |
| | Large livestock (cows) | \( 73.02\)  | \( 67.37\)^{**}  | \(  8.49\)  | \( -1.23\)  | \( 74.25\)  | \( 68.60\)  |
 |  | $N=1306$  | (\( 55.03\))    | (\( 31.37\))    | (\( 54.74\))    | (\( 28.57\))    | (\( 62.00\))    | (\( 42.43\))  |
| | Limited portions | \( -0.33\)  | \(  0.35\)  | \(  0.21\)  | \(  0.41\)  | \( -0.75\)  | \( -0.06\)  |
 |  | $N=1292$  | (\(  0.68\))    | (\(  0.65\))    | (\(  0.77\))    | (\(  0.85\))    | (\(  1.09\))    | (\(  1.07\))  |
| | Milk (last three days) | \(  0.12\)  | \(  0.03\)  | \(  0.05\)  | \( -0.21\)  | \(  0.34\)  | \(  0.25\)  |
 |  | $N=1285$  | (\(  0.13\))    | (\(  0.16\))    | (\(  0.15\))    | (\(  0.16\))    | (\(  0.21\))    | (\(  0.22\))  |
| | Mobile phone | \( 11.78\)  | \(  2.08\)  | \( -7.73\)  | \( 15.26\)  | \( -3.49\)  | \(-13.19\)  |
 |  | $N=1306$  | (\( 12.27\))    | (\(  8.54\))    | (\( 13.76\))    | (\( 10.85\))    | (\( 16.38\))    | (\( 13.81\))  |
| | Mosquito net | \( -0.35\)  | \(  0.30\)  | \(  0.47\)  | \(  0.13\)  | \( -0.49\)  | \(  0.17\)  |
 |  | $N=1306$  | (\(  1.77\))    | (\(  1.79\))    | (\(  2.03\))    | (\(  1.97\))    | (\(  2.65\))    | (\(  2.66\))  |
| | Motorcycle | \(-117.62\)  | \( 57.72\)  | \(-119.70\)  | \(  6.15\)  | \(-123.77\)  | \( 51.58\)  |
 |  | $N=1306$  | (\( 77.25\))    | (\( 79.55\))    | (\( 88.81\))    | (\( 97.62\))    | (\(124.49\))    | (\(125.93\))  |
| | No food in house | \(  0.54\)  | \(  0.54\)  | \(  0.21\)  | \(  0.03\)  | \(  0.52\)  | \(  0.51\)  |
 |  | $N=1293$  | (\(  0.48\))    | (\(  0.65\))    | (\(  0.58\))    | (\(  0.85\))    | (\(  0.98\))    | (\(  1.07\))  |
| | No preferred | \( -0.32\)  | \(  0.35\)  | \(  0.65\)  | \( -1.72\)^{*}  | \(  1.40\)  | \(  2.07\)  |
 |  | $N=1297$  | (\(  0.75\))    | (\(  0.75\))    | (\(  0.89\))    | (\(  1.02\))    | (\(  1.26\))    | (\(  1.26\))  |
| | Oil (last three days) | \(  0.06\)  | \(  0.02\)  | \( -0.27\)  | \(  0.36\)  | \( -0.31\)  | \( -0.34\)  |
 |  | $N=1285$  | (\(  0.15\))    | (\(  0.18\))    | (\(  0.18\))    | (\(  0.25\))    | (\(  0.29\))    | (\(  0.31\))  |
| | Other food (last three days) | \( -0.66\)  | \( -0.71\)  | \(  1.13\)^{*}  | \( -0.83\)  | \(  0.17\)  | \(  0.12\)  |
 |  | $N=1306$  | (\(  0.42\))    | (\(  1.31\))    | (\(  0.64\))    | (\(  1.62\))    | (\(  1.67\))    | (\(  2.08\))  |
| | Other non-food (last year) | \( -2.20\)^{**}  | \(  0.03\)  | \( -1.42\)  | \(  0.03\)  | \( -2.23\)^{**}  | \( -0.00\)  |
 |  | $N=1306$  | (\(  0.89\))    | (\(  0.18\))    | (\(  1.23\))    | (\(  0.19\))    | (\(  0.91\))    | (\(  0.26\))  |
| | Poultry | \(  0.50\)  | \(  1.47\)  | \( -0.21\)  | \(  1.27\)  | \( -0.76\)  | \(  0.21\)  |
 |  | $N=1285$  | (\(  0.67\))    | (\(  1.05\))    | (\(  0.71\))    | (\(  1.53\))    | (\(  1.67\))    | (\(  1.85\))  |
| | Radio | \(  3.72\)  | \(  0.60\)  | \(  1.52\)  | \(  4.30\)  | \( -0.58\)  | \( -3.70\)  |
 |  | $N=1306$  | (\(  7.35\))    | (\(  4.58\))    | (\(  8.75\))    | (\(  6.01\))    | (\(  9.50\))    | (\(  7.56\))  |
| | Rituals/ceremonies (last year) | \( 14.81\)^{***}  | \(  0.19\)  | \( 10.05\)  | \(  6.05\)  | \(  8.75\)  | \( -5.87\)  |
 |  | $N=1306$  | (\(  5.54\))    | (\(  3.84\))    | (\(  8.08\))    | (\(  6.24\))    | (\(  8.34\))    | (\(  7.33\))  |
| | Salt (last three days) | \( -0.04\)  | \(  0.12\)  | \( -0.04\)  | \( -0.02\)  | \( -0.01\)  | \(  0.14\)  |
 |  | $N=1285$  | (\(  0.03\))    | (\(  0.11\))    | (\(  0.04\))    | (\(  0.12\))    | (\(  0.13\))    | (\(  0.17\))  |
| | Small livestock | \(118.33\)^{***}  | \( 77.14\)^{**}  | \(-18.38\)  | \(  0.13\)  | \(118.20\)^{**}  | \( 77.01\)  |
 |  | $N=1306$  | (\( 37.16\))    | (\( 33.95\))    | (\( 32.62\))    | (\( 32.63\))    | (\( 49.46\))    | (\( 47.09\))  |
| | Spices (last three days) | \(  0.21\)^{**}  | \( -0.08\)^{*}  | \(  0.02\)  | \( -0.06\)  | \(  0.27\)^{**}  | \( -0.02\)  |
 |  | $N=1285$  | (\(  0.10\))    | (\(  0.05\))    | (\(  0.09\))    | (\(  0.05\))    | (\(  0.11\))    | (\(  0.07\))  |
| | Sugar (last three days) | \(  0.51\)^{**}  | \( -0.08\)  | \(  0.15\)  | \( -0.00\)  | \(  0.51\)  | \( -0.07\)  |
 |  | $N=1285$  | (\(  0.25\))    | (\(  0.40\))    | (\(  0.30\))    | (\(  0.47\))    | (\(  0.53\))    | (\(  0.61\))  |
| | Textiles (last year) | \( 10.00\)^{*}  | \( -6.74\)  | \( -2.44\)  | \(  6.77\)  | \(  3.23\)  | \(-13.51\)  |
 |  | $N=1306$  | (\(  5.43\))    | (\(  6.16\))    | (\(  5.26\))    | (\(  8.16\))    | (\(  9.80\))    | (\( 10.22\))  |
| | Toiletries (last month) | \(  3.12\)  | \(  3.36\)  | \( -4.70\)^{**}  | \( -2.47\)  | \(  5.59\)^{*}  | \(  5.83\)^{*}  |
 |  | $N=1306$  | (\(  1.99\))    | (\(  2.42\))    | (\(  1.98\))    | (\(  2.37\))    | (\(  3.10\))    | (\(  3.39\))  |
| | Transportation (last month) | \(  2.30\)  | \(  0.64\)  | \(  0.45\)  | \(  1.04\)  | \(  1.26\)  | \( -0.40\)  |
 |  | $N=1306$  | (\(  1.72\))    | (\(  2.43\))    | (\(  2.24\))    | (\(  3.14\))    | (\(  3.58\))    | (\(  3.97\))  |
| | Utensils (last year) | \( 17.00\)  | \( -1.13\)  | \( 21.99\)  | \(  1.13\)  | \( 15.88\)  | \( -2.26\)  |
 |  | $N=1306$  | (\( 14.13\))    | (\(  6.33\))    | (\( 17.18\))    | (\(  7.52\))    | (\( 16.00\))    | (\(  9.83\))  |
| | Vegetables (last three days) | \(  0.71\)^{**}  | \(  0.39\)  | \( -0.89\)^{***}  | \(  0.63\)  | \(  0.08\)  | \( -0.24\)  |
 |  | $N=1285$  | (\(  0.31\))    | (\(  0.40\))    | (\(  0.29\))    | (\(  0.48\))    | (\(  0.58\))    | (\(  0.63\))  |
| | Went hungry | \(  0.94\)^{**}  | \( -0.14\)  | \(  0.46\)  | \( -0.77\)  | \(  1.71\)^{*}  | \(  0.63\)  |
 |  | $N=1297$  | (\(  0.43\))    | (\(  0.67\))    | (\(  0.58\))    | (\(  0.91\))    | (\(  1.01\))    | (\(  1.12\))  |
| | Whole day without eating | \(  0.54\)  | \( -0.23\)  | \(  0.13\)  | \( -0.92\)  | \(  1.46\)  | \(  0.69\)  |
 |  | $N=1282$  | (\(  0.46\))    | (\(  0.68\))    | (\(  0.63\))    | (\(  0.96\))    | (\(  1.06\))    | (\(  1.18\))  |
| | Worried | \(  1.76\)^{*}  | \(  1.05\)  | \( -0.54\)  | \( -0.40\)  | \(  2.16\)  | \(  1.45\)  |
 |  | $N=1291$  | (\(  1.00\))    | (\(  0.83\))    | (\(  1.29\))    | (\(  1.09\))    | (\(  1.48\))    | (\(  1.37\))  |
| | airtime | \(  7.02\)^{***}  | \(  2.03\)  | \( -2.35\)  | \(  0.21\)  | \(  6.81\)^{*}  | \(  1.82\)  |
 |  | $N=1306$  | (\(  2.33\))    | (\(  2.72\))    | (\(  1.99\))    | (\(  2.96\))    | (\(  3.77\))    | (\(  4.02\))  |
| | axes | \( -1.62\)^{*}  | \( -0.86\)  | \( -1.38\)  | \( -1.35\)  | \( -0.27\)  | \(  0.49\)  |
 |  | $N=1306$  | (\(  0.85\))    | (\(  0.80\))    | (\(  1.05\))    | (\(  0.91\))    | (\(  1.24\))    | (\(  1.21\))  |
| | batteries | \(  0.69\)  | \( -0.17\)  | \( -0.04\)  | \(  0.48\)  | \(  0.22\)  | \( -0.65\)  |
 |  | $N=1306$  | (\(  0.66\))    | (\(  0.75\))    | (\(  0.76\))    | (\(  0.97\))    | (\(  1.17\))    | (\(  1.22\))  |
| | bread | \(  0.27\)  | \( -0.10\)  | \( -0.28\)  | \( -0.16\)  | \(  0.43\)  | \(  0.07\)  |
 |  | $N=1285$  | (\(  0.23\))    | (\(  0.29\))    | (\(  0.26\))    | (\(  0.38\))    | (\(  0.45\))    | (\(  0.48\))  |
| | carts | \(  0.04\)  | \( -0.20\)  | \(  0.04\)  | \(  0.31\)  | \( -0.27\)  | \( -0.51\)  |
 |  | $N=1306$  | (\(  0.04\))    | (\(  0.15\))    | (\(  0.04\))    | (\(  0.37\))    | (\(  0.37\))    | (\(  0.40\))  |
| | charcoal | \( -0.94\)  | \( -1.58\)  | \( -1.25\)  | \( -3.00\)^{*}  | \(  2.06\)  | \(  1.42\)  |
 |  | $N=1306$  | (\(  1.17\))    | (\(  1.47\))    | (\(  1.43\))    | (\(  1.73\))    | (\(  2.09\))    | (\(  2.27\))  |
| | chickens | \( 16.26\)^{*}  | \( 16.94\)^{*}  | \( -9.62\)  | \( 15.00\)  | \(  1.26\)  | \(  1.94\)  |
 |  | $N=1306$  | (\(  9.61\))    | (\(  9.17\))    | (\(  9.20\))    | (\( 10.37\))    | (\( 14.14\))    | (\( 13.84\))  |
| | childcare | \(  3.03\)  | \(  1.04\)  | \( -3.19\)  | \( -0.87\)  | \(  3.90\)  | \(  1.91\)  |
 |  | $N=1306$  | (\(  2.22\))    | (\(  2.62\))    | (\(  2.35\))    | (\(  2.92\))    | (\(  3.66\))    | (\(  3.92\))  |
| | childrensclothes | \(-33.38\)  | \(  6.91\)  | \(-83.39\)^{***}  | \( -5.19\)  | \(-28.19\)  | \( 12.10\)  |
 |  | $N=1306$  | (\( 23.98\))    | (\( 18.83\))    | (\( 26.03\))    | (\( 24.37\))    | (\( 34.19\))    | (\( 30.80\))  |
| | church | \(  0.00\)  | \( -1.75\)  | \(  0.00\)^{**}  | \( -1.43\)  | \(  1.43\)  | \( -0.33\)  |
 |  | $N=700$  | (\(  0.00\))    | (\(  1.22\))    | (\(  0.00\))    | (\(  1.70\))    | (\(  1.70\))    | (\(  2.09\))  |
| | ducks | \(152.42\)^{***}  | \(164.43\)^{***}  | \( -4.47\)  | \(  2.68\)  | \(149.73\)^{***}  | \(161.75\)^{***}  |
 |  | $N=1306$  | (\( 15.64\))    | (\( 18.86\))    | (\(  7.80\))    | (\( 13.32\))    | (\( 20.54\))    | (\( 23.09\))  |
| | durables | \(  2.70\)  | \( -0.00\)^{**}  | \( 10.21\)^{**}  | \(  0.00\)  | \(  2.70\)  | \( -0.00\)^{**}  |
 |  | $N=606$  | (\(  3.24\))    | (\(  0.00\))    | (\(  4.51\))    | (\(  0.00\))    | (\(  3.24\))    | (\(  0.00\))  |
| | fan | \(  0.23\)  | \( -0.99\)  | \( -3.59\)  | \( -3.08\)^{*}  | \(  3.30\)  | \(  2.09\)  |
 |  | $N=1306$  | (\(  2.93\))    | (\(  1.86\))    | (\(  3.23\))    | (\(  1.64\))    | (\(  3.36\))    | (\(  2.48\))  |
| | farm_income_yearly_sum | \(  0.00\)  | \(-131.25\)  | \( -0.00\)^{***}  | \( 23.72\)  | \(-23.72\)  | \(-154.96\)  |
 |  | $N=544$  | (\(  0.00\))    | (\( 95.30\))    | (\(  0.00\))    | (\(133.41\))    | (\(133.41\))    | (\(163.95\))  |
| | funerals | \( 46.08\)^{**}  | \(-40.21\)  | \( 36.23\)  | \( 95.40\)  | \(-49.32\)  | \(-135.61\)  |
 |  | $N=1306$  | (\( 19.94\))    | (\( 85.23\))    | (\( 26.40\))    | (\(146.35\))    | (\(147.70\))    | (\(169.36\))  |
| | homeimprovement | \( 23.73\)^{***}  | \(  2.81\)  | \( -1.46\)  | \(-10.44\)  | \( 34.17\)^{***}  | \( 13.24\)  |
 |  | $N=1306$  | (\(  7.60\))    | (\(  9.54\))    | (\(  6.41\))    | (\(  9.38\))    | (\( 12.07\))    | (\( 13.38\))  |
| | land_communitycult | \(  0.01\)  | \( -0.04\)  | \( -0.02\)  | \(  0.06\)  | \( -0.05\)  | \( -0.09\)  |
 |  | $N=938$  | (\(  0.02\))    | (\(  0.03\))    | (\(  0.01\))    | (\(  0.07\))    | (\(  0.07\))    | (\(  0.07\))  |
| | land_owncult | \(  0.13\)  | \( -0.01\)  | \( -0.17\)^{*}  | \(  0.20\)  | \( -0.06\)  | \( -0.21\)  |
 |  | $N=1224$  | (\(  0.11\))    | (\(  0.09\))    | (\(  0.10\))    | (\(  0.15\))    | (\(  0.19\))    | (\(  0.18\))  |
| | land_ownnocult | \(  0.32\)^{***}  | \(  0.10\)  | \(  0.15\)  | \(  0.30\)  | \(  0.02\)  | \( -0.20\)  |
 |  | $N=1035$  | (\(  0.09\))    | (\(  0.07\))    | (\(  0.14\))    | (\(  0.23\))    | (\(  0.25\))    | (\(  0.24\))  |
| | land_ownrent | \( -0.01\)  | \(  0.04\)  | \( -0.02\)^{*}  | \(  0.03\)  | \( -0.04\)  | \(  0.01\)  |
 |  | $N=944$  | (\(  0.02\))    | (\(  0.06\))    | (\(  0.01\))    | (\(  0.07\))    | (\(  0.07\))    | (\(  0.09\))  |
| | land_rentcult | \( -0.01\)  | \(  0.04\)  | \( -0.02\)  | \(  0.05\)^{*}  | \( -0.05\)^{*}  | \( -0.01\)  |
 |  | $N=945$  | (\(  0.01\))    | (\(  0.03\))    | (\(  0.01\))    | (\(  0.03\))    | (\(  0.03\))    | (\(  0.04\))  |
| | livestock | \(  0.05\)  | \(  0.49\)  | \( -0.26\)  | \(  2.06\)  | \( -2.01\)  | \( -1.56\)  |
 |  | $N=1285$  | (\(  0.95\))    | (\(  1.05\))    | (\(  1.07\))    | (\(  1.45\))    | (\(  1.73\))    | (\(  1.79\))  |
| | livestock_income_yearly_sum | \(  0.00\)  | \(221.91\)  | \(  0.00\)  | \(-253.10\)  | \(253.10\)  | \(475.01\)  |
 |  | $N=544$  | (\(  0.00\))    | (\(285.13\))    | (\(  0.00\))    | (\(280.10\))    | (\(280.10\))    | (\(399.70\))  |
| | maize | \(  1.97\)^{*}  | \(  0.39\)  | \( -2.89\)^{**}  | \(  0.96\)  | \(  1.00\)  | \( -0.57\)  |
 |  | $N=1285$  | (\(  1.16\))    | (\(  1.53\))    | (\(  1.27\))    | (\(  2.09\))    | (\(  2.40\))    | (\(  2.59\))  |
| | medicine | \( 36.86\)  | \( 30.78\)  | \( 38.88\)  | \( 76.12\)^{**}  | \(-39.26\)  | \(-45.35\)  |
 |  | $N=1306$  | (\( 25.11\))    | (\( 24.96\))    | (\( 39.42\))    | (\( 36.79\))    | (\( 44.54\))    | (\( 44.46\))  |
| | millet | \(  0.68\)^{**}  | \( -0.18\)  | \(  0.04\)  | \( -0.20\)  | \(  0.88\)^{**}  | \(  0.02\)  |
 |  | $N=1285$  | (\(  0.30\))    | (\(  0.17\))    | (\(  0.28\))    | (\(  0.22\))    | (\(  0.37\))    | (\(  0.28\))  |
| | nuts | \(  0.44\)^{**}  | \( -0.44\)^{*}  | \( -0.34\)^{*}  | \(  0.33\)  | \(  0.11\)  | \( -0.76\)^{*}  |
 |  | $N=1285$  | (\(  0.19\))    | (\(  0.23\))    | (\(  0.20\))    | (\(  0.33\))    | (\(  0.38\))    | (\(  0.40\))  |
| | othermonth | \( -1.19\)^{*}  | \(  0.07\)  | \( -0.72\)  | \(  0.05\)  | \( -1.24\)^{**}  | \(  0.02\)  |
 |  | $N=1306$  | (\(  0.63\))    | (\(  0.04\))    | (\(  0.82\))    | (\(  0.06\))    | (\(  0.63\))    | (\(  0.07\))  |
| | pangas | \(  0.71\)  | \(  0.62\)  | \( -0.03\)  | \( -1.00\)  | \(  1.71\)  | \(  1.63\)  |
 |  | $N=1306$  | (\(  0.66\))    | (\(  0.74\))    | (\(  0.84\))    | (\(  0.88\))    | (\(  1.10\))    | (\(  1.15\))  |
| | plough | \(  0.87\)  | \( -0.24\)  | \( -0.01\)  | \( -0.57\)^{**}  | \(  1.44\)^{*}  | \(  0.33\)  |
 |  | $N=1306$  | (\(  0.77\))    | (\(  0.32\))    | (\(  0.74\))    | (\(  0.28\))    | (\(  0.82\))    | (\(  0.42\))  |
| | ploughs_again | \(  0.00\)  | \(  0.00\)  | \( -0.05\)  | \(  0.00\)  | \(  0.00\)  | \( -0.00\)  |
 |  | $N=1306$  | (\(  0.16\))    | (\(  0.00\))    | (\(  0.18\))    | (\(  0.00\))    | (\(  0.16\))    | (\(  0.00\))  |
| | potato | \(  0.22\)^{**}  | \(  0.02\)  | \(  0.05\)  | \(  0.19\)^{*}  | \(  0.03\)  | \( -0.18\)  |
 |  | $N=1285$  | (\(  0.09\))    | (\(  0.04\))    | (\(  0.08\))    | (\(  0.10\))    | (\(  0.13\))    | (\(  0.11\))  |
| | potspans | \( -8.84\)  | \(  7.33\)  | \( -1.55\)  | \(-18.16\)  | \(  9.32\)  | \( 25.49\)^{*}  |
 |  | $N=1306$  | (\(  7.88\))    | (\( 10.36\))    | (\( 10.10\))    | (\( 11.23\))    | (\( 13.72\))    | (\( 15.28\))  |
| | rice | \(  0.14\)  | \( -0.00\)  | \( -0.31\)  | \(  1.07\)  | \( -0.92\)  | \( -1.07\)  |
 |  | $N=1285$  | (\(  0.36\))    | (\(  0.56\))    | (\(  0.38\))    | (\(  0.69\))    | (\(  0.78\))    | (\(  0.89\))  |
| | savings_BRAC | \(  8.97\)^{***}  | \( 73.93\)^{***}  | \(  5.29\)  | \(  3.52\)  | \(  5.45\)  | \( 70.41\)^{***}  |
 |  | $N=1306$  | (\(  1.08\))    | (\( 11.99\))    | (\(  4.99\))    | (\(  5.76\))    | (\(  5.86\))    | (\( 13.30\))  |
| | savings_NGOs | \( -0.00\)  | \(  0.01\)  | \( -0.00\)  | \( -0.00\)  | \(  0.00\)  | \(  0.01\)  |
 |  | $N=1306$  | (\(  0.00\))    | (\(  0.01\))    | (\(  0.00\))    | (\(  0.00\))    | (\(  0.00\))    | (\(  0.01\))  |
| | savings_bank | \( 15.51\)  | \( 33.09\)  | \( -1.59\)  | \(  5.14\)  | \( 10.37\)  | \( 27.95\)  |
 |  | $N=1306$  | (\(  9.50\))    | (\( 29.87\))    | (\(  2.03\))    | (\(  3.38\))    | (\( 10.08\))    | (\( 30.06\))  |
| | savings_home | \(-24.28\)  | \( -6.38\)  | \( 14.97\)  | \( 20.00\)  | \(-44.28\)  | \(-26.38\)  |
 |  | $N=1306$  | (\( 16.81\))    | (\( 17.50\))    | (\( 37.85\))    | (\( 21.65\))    | (\( 27.41\))    | (\( 27.84\))  |
| | savings_maize_val | \( 16.00\)^{*}  | \( -0.55\)  | \(  1.71\)  | \( -3.12\)  | \( 19.12\)^{*}  | \(  2.56\)  |
 |  | $N=1306$  | (\(  8.71\))    | (\(  6.28\))    | (\(  5.81\))    | (\(  7.42\))    | (\( 11.45\))    | (\(  9.72\))  |
| | savings_other | \(  0.14\)  | \(  0.36\)  | \( -0.13\)  | \(  9.33\)  | \( -9.19\)  | \( -8.98\)  |
 |  | $N=1306$  | (\(  0.72\))    | (\(  3.53\))    | (\(  0.68\))    | (\(  9.94\))    | (\(  9.97\))    | (\( 10.55\))  |
| | savings_otherfood1_val | \( 11.67\)  | \( -3.65\)  | \(  0.58\)  | \( -1.74\)  | \( 13.41\)  | \( -1.91\)  |
 |  | $N=1306$  | (\( 12.75\))    | (\(  8.79\))    | (\( 11.26\))    | (\( 11.32\))    | (\( 17.05\))    | (\( 14.33\))  |
| | savings_otherfood2_val | \( -0.22\)  | \( -0.76\)  | \(  1.08\)  | \(  1.56\)  | \( -1.78\)  | \( -2.32\)  |
 |  | $N=1306$  | (\(  1.10\))    | (\(  1.31\))    | (\(  1.96\))    | (\(  3.74\))    | (\(  3.90\))    | (\(  3.96\))  |
| | savings_sorghum_val | \(  1.88\)  | \( -1.28\)  | \( -6.43\)  | \( -0.91\)  | \(  2.78\)  | \( -0.37\)  |
 |  | $N=1306$  | (\(  8.85\))    | (\(  6.60\))    | (\(  6.04\))    | (\(  5.78\))    | (\( 10.57\))    | (\(  8.77\))  |
| | sewing | \( -8.48\)  | \(  5.10\)  | \(-11.18\)  | \( -2.89\)  | \( -5.59\)  | \(  7.98\)  |
 |  | $N=1306$  | (\( 10.34\))    | (\(  6.36\))    | (\( 11.72\))    | (\(  4.44\))    | (\( 11.26\))    | (\(  7.76\))  |
| | shed | \( 20.44\)^{***}  | \(  8.86\)^{***}  | \( 12.72\)  | \(  1.63\)  | \( 18.81\)^{***}  | \(  7.23\)^{*}  |
 |  | $N=1306$  | (\(  5.65\))    | (\(  2.81\))    | (\(  8.38\))    | (\(  2.79\))    | (\(  6.30\))    | (\(  3.96\))  |
| | shoes | \( 19.56\)^{***}  | \( -3.91\)  | \( -5.59\)  | \(-18.81\)  | \( 38.37\)^{***}  | \( 14.90\)  |
 |  | $N=1306$  | (\(  6.64\))    | (\( 11.34\))    | (\(  7.49\))    | (\( 12.36\))    | (\( 14.03\))    | (\( 16.78\))  |
| | shop | \( 12.52\)  | \(  0.15\)  | \( 39.12\)  | \( -4.48\)  | \( 17.00\)  | \(  4.63\)  |
 |  | $N=1306$  | (\( 16.56\))    | (\(  5.26\))    | (\( 28.97\))    | (\(  5.40\))    | (\( 17.42\))    | (\(  7.54\))  |
| | sorghum | \(  1.83\)^{**}  | \( -0.91\)  | \(  2.23\)^{**}  | \(  2.01\)  | \( -0.17\)  | \( -2.91\)  |
 |  | $N=1285$  | (\(  0.86\))    | (\(  1.43\))    | (\(  1.09\))    | (\(  2.12\))    | (\(  2.29\))    | (\(  2.56\))  |
| | source1 | \(  0.00\)  | \(266.07\)  | \( -0.00\)  | \(908.77\)  | \(-908.77\)  | \(-642.70\)  |
 |  | $N=656$  | (\(  0.00\))    | (\(418.10\))    | (\(  0.00\))    | (\(1059.87\))    | (\(1059.87\))    | (\(1139.35\))  |
| | source2 | \(  0.00\)  | \(754.08\)  | \( -0.00\)  | \(-251.10\)  | \(251.10\)  | \(1005.19\)  |
 |  | $N=656$  | (\(  0.00\))    | (\(895.26\))    | (\(  0.00\))    | (\(229.54\))    | (\(229.54\))    | (\(924.22\))  |
| | source3 | \(  0.00\)  | \(-47.90\)  | \(  0.00\)  | \( 95.27\)  | \(-95.27\)  | \(-143.18\)  |
 |  | $N=656$  | (\(  0.00\))    | (\( 35.77\))    | (\(  0.00\))    | (\(117.47\))    | (\(117.47\))    | (\(122.79\))  |
| | source4 | \(  0.00\)  | \(-18.18\)  | \(  0.00\)  | \(-40.52\)  | \( 40.52\)  | \( 22.34\)  |
 |  | $N=656$  | (\(  0.00\))    | (\( 34.27\))    | (\(  0.00\))    | (\( 26.13\))    | (\( 26.13\))    | (\( 43.09\))  |
| | source5 | \(  0.00\)  | \(  5.09\)  | \( -0.00\)  | \( -0.44\)  | \(  0.44\)  | \(  5.53\)  |
 |  | $N=656$  | (\(  0.00\))    | (\(  5.56\))    | (\(  0.00\))    | (\(  0.44\))    | (\(  0.44\))    | (\(  5.58\))  |
| | stoves | \(  0.13\)  | \(  3.08\)^{**}  | \( -0.26\)  | \(  0.53\)  | \( -0.40\)  | \(  2.55\)  |
 |  | $N=1306$  | (\(  1.55\))    | (\(  1.55\))    | (\(  1.92\))    | (\(  1.39\))    | (\(  2.09\))    | (\(  2.08\))  |
| | sweetpotato | \(  0.51\)^{***}  | \(  0.08\)  | \( -0.01\)  | \(  0.01\)  | \(  0.49\)^{***}  | \(  0.06\)  |
 |  | $N=1285$  | (\(  0.17\))    | (\(  0.07\))    | (\(  0.17\))    | (\(  0.08\))    | (\(  0.19\))    | (\(  0.11\))  |
| | tea | \(  0.18\)  | \( -0.04\)  | \( -0.09\)  | \(  0.21\)  | \( -0.03\)  | \( -0.25\)  |
 |  | $N=1285$  | (\(  0.17\))    | (\(  0.22\))    | (\(  0.18\))    | (\(  0.30\))    | (\(  0.35\))    | (\(  0.37\))  |
| | tobacco | \(  1.12\)  | \( -0.36\)  | \(  1.58\)  | \( -0.70\)^{*}  | \(  1.81\)^{**}  | \(  0.34\)  |
 |  | $N=1306$  | (\(  0.76\))    | (\(  0.37\))    | (\(  1.19\))    | (\(  0.38\))    | (\(  0.85\))    | (\(  0.53\))  |
| | transfers_give1 | \( -7.35\)  | \( -4.13\)  | \(-21.04\)  | \(  1.87\)  | \( -9.22\)  | \( -6.00\)  |
 |  | $N=1306$  | (\( 20.78\))    | (\(  5.10\))    | (\( 20.43\))    | (\( 12.04\))    | (\( 24.02\))    | (\( 13.07\))  |
| | transfers_give2 | \(  2.75\)  | \( -0.12\)  | \( -1.73\)  | \( -0.11\)  | \(  2.86\)  | \( -0.01\)  |
 |  | $N=1306$  | (\(  2.45\))    | (\(  0.49\))    | (\(  1.28\))    | (\(  0.53\))    | (\(  2.51\))    | (\(  0.72\))  |
| | transfers_give3 | \( -0.32\)  | \( -0.05\)  | \( -0.32\)  | \( -0.05\)  | \( -0.28\)  | \(  0.00\)  |
 |  | $N=1306$  | (\(  0.30\))    | (\(  0.03\))    | (\(  0.30\))    | (\(  0.03\))    | (\(  0.30\))    | (\(  0.05\))  |
| | tv | \(-11.81\)  | \( 14.58\)  | \( -8.66\)  | \(  7.73\)  | \(-19.54\)  | \(  6.85\)  |
 |  | $N=1306$  | (\(  8.68\))    | (\( 11.72\))    | (\( 10.94\))    | (\( 14.92\))    | (\( 17.27\))    | (\( 18.97\))  |
| | womensclothes | \( 14.91\)^{*}  | \( 16.33\)  | \( -3.89\)  | \(  0.69\)  | \( 14.22\)  | \( 15.64\)  |
 |  | $N=1306$  | (\(  8.39\))    | (\( 15.63\))    | (\(  8.20\))    | (\( 18.69\))    | (\( 20.49\))    | (\( 24.36\))  |
| Nonzero |  Meat (last three days) | \(  0.05\)  | \(  0.05\)  | \(  0.02\)  | \(  0.07\)  | \( -0.01\)  | \( -0.02\)  |
 |  | $N=1306$  | (\(  0.04\))    | (\(  0.04\))    | (\(  0.05\))    | (\(  0.05\))    | (\(  0.07\))    | (\(  0.06\))  |
| | Alcohol (last three days) | \(  0.03\)  | \(  0.02\)^{*}  | \(  0.03\)  | \(  0.01\)  | \(  0.02\)  | \(  0.01\)  |
 |  | $N=1285$  | (\(  0.02\))    | (\(  0.01\))    | (\(  0.03\))    | (\(  0.01\))    | (\(  0.02\))    | (\(  0.02\))  |
| | Ate unpreferred | \( -0.01\)  | \(  0.01\)  | \(  0.04\)  | \( -0.04\)  | \(  0.03\)  | \(  0.05\)  |
 |  | $N=1297$  | (\(  0.03\))    | (\(  0.02\))    | (\(  0.03\))    | (\(  0.04\))    | (\(  0.05\))    | (\(  0.04\))  |
| | Beans (last three days) | \( -0.03\)  | \(  0.04\)  | \( -0.05\)  | \( -0.01\)  | \( -0.02\)  | \(  0.04\)  |
 |  | $N=1285$  | (\(  0.03\))    | (\(  0.04\))    | (\(  0.04\))    | (\(  0.05\))    | (\(  0.06\))    | (\(  0.07\))  |
| | Bed | \(  0.00\)  | \( -0.01\)  | \(  0.05\)  | \( -0.04\)  | \(  0.04\)  | \(  0.03\)  |
 |  | $N=1306$  | (\(  0.03\))    | (\(  0.03\))    | (\(  0.03\))    | (\(  0.04\))    | (\(  0.05\))    | (\(  0.05\))  |
| | Bicycle | \(  0.01\)  | \( -0.00\)  | \( -0.00\)  | \(  0.00\)  | \(  0.01\)  | \( -0.00\)  |
 |  | $N=1306$  | (\(  0.04\))    | (\(  0.03\))    | (\(  0.04\))    | (\(  0.04\))    | (\(  0.06\))    | (\(  0.06\))  |
| | Cereals (last three days) | \(  0.01\)  | \(  0.03\)  | \(  0.02\)  | \(  0.05\)  | \( -0.04\)  | \( -0.02\)  |
 |  | $N=1306$  | (\(  0.02\))    | (\(  0.03\))    | (\(  0.02\))    | (\(  0.04\))    | (\(  0.04\))    | (\(  0.05\))  |
| | Chair/table | \(  0.02\)  | \( -0.03\)  | \(  0.00\)  | \( -0.00\)  | \(  0.02\)  | \( -0.03\)  |
 |  | $N=1306$  | (\(  0.02\))    | (\(  0.03\))    | (\(  0.03\))    | (\(  0.03\))    | (\(  0.04\))    | (\(  0.04\))  |
| | Charities (last year) | \(  0.02\)  | \(  0.00\)^{***}  | \(  0.00\)  | \(  0.00\)^{***}  | \(  0.02\)  | \( -0.00\)  |
 |  | $N=606$  | (\(  0.04\))    | (\(  0.00\))    | (\(  0.05\))    | (\(  0.00\))    | (\(  0.04\))    | (\(  0.00\))  |
| | Clothing, footwear (last year) | \( -0.05\)  | \(  0.01\)  | \( -0.05\)  | \(  0.11\)^{**}  | \( -0.16\)^{**}  | \( -0.10\)  |
 |  | $N=1306$  | (\(  0.04\))    | (\(  0.04\))    | (\(  0.05\))    | (\(  0.05\))    | (\(  0.07\))    | (\(  0.07\))  |
| | Cooking fuel (last month) | \( -0.01\)  | \(  0.03\)  | \( -0.00\)  | \(  0.02\)  | \( -0.03\)  | \(  0.01\)  |
 |  | $N=1306$  | (\(  0.02\))    | (\(  0.02\))    | (\(  0.03\))    | (\(  0.03\))    | (\(  0.04\))    | (\(  0.04\))  |
| | Cosmetics (last month) | \( -0.03\)  | \( -0.00\)  | \(  0.04\)  | \( -0.04\)  | \(  0.01\)  | \(  0.03\)  |
 |  | $N=1306$  | (\(  0.04\))    | (\(  0.03\))    | (\(  0.05\))    | (\(  0.04\))    | (\(  0.06\))    | (\(  0.05\))  |
| | Dowry (last year) | \(  0.04\)  | \(  0.04\)  | \( -0.02\)  | \(  0.02\)  | \(  0.02\)  | \(  0.01\)  |
 |  | $N=1306$  | (\(  0.03\))    | (\(  0.02\))    | (\(  0.02\))    | (\(  0.03\))    | (\(  0.04\))    | (\(  0.04\))  |
| | Egg (last three days) | \(  0.03\)  | \( -0.01\)  | \(  0.02\)  | \( -0.03\)  | \(  0.06\)  | \(  0.02\)  |
 |  | $N=1285$  | (\(  0.03\))    | (\(  0.03\))    | (\(  0.04\))    | (\(  0.03\))    | (\(  0.05\))    | (\(  0.04\))  |
| | Entertainment (last month) | \( -0.02\)  | \( -0.01\)  | \( -0.05\)^{**}  | \( -0.02\)  | \( -0.00\)  | \(  0.00\)  |
 |  | $N=1306$  | (\(  0.02\))    | (\(  0.01\))    | (\(  0.02\))    | (\(  0.01\))    | (\(  0.03\))    | (\(  0.01\))  |
| | Few kinds | \( -0.03\)  | \( -0.01\)  | \( -0.01\)  | \( -0.03\)  | \( -0.00\)  | \(  0.02\)  |
 |  | $N=1297$  | (\(  0.03\))    | (\(  0.03\))    | (\(  0.03\))    | (\(  0.04\))    | (\(  0.05\))    | (\(  0.05\))  |
| | Fewer Meals | \( -0.01\)  | \( -0.02\)  | \(  0.00\)  | \(  0.00\)  | \( -0.01\)  | \( -0.02\)  |
 |  | $N=1297$  | (\(  0.02\))    | (\(  0.02\))    | (\(  0.03\))    | (\(  0.03\))    | (\(  0.03\))    | (\(  0.03\))  |
| | Fish (last three days) | \(  0.09\)^{**}  | \( -0.10\)^{**}  | \(  0.11\)^{**}  | \( -0.03\)  | \(  0.12\)^{*}  | \( -0.07\)  |
 |  | $N=1285$  | (\(  0.04\))    | (\(  0.04\))    | (\(  0.05\))    | (\(  0.05\))    | (\(  0.07\))    | (\(  0.07\))  |
| | Fruit (last three days) | \(  0.06\)  | \(  0.00\)  | \(  0.07\)  | \(  0.02\)  | \(  0.04\)  | \( -0.02\)  |
 |  | $N=1285$  | (\(  0.04\))    | (\(  0.04\))    | (\(  0.05\))    | (\(  0.05\))    | (\(  0.06\))    | (\(  0.07\))  |
| | Furniture (last year) | \(  0.04\)  | \( -0.01\)  | \(  0.18\)^{***}  | \( -0.02\)  | \(  0.07\)  | \(  0.01\)  |
 |  | $N=1306$  | (\(  0.04\))    | (\(  0.02\))    | (\(  0.05\))    | (\(  0.03\))    | (\(  0.05\))    | (\(  0.03\))  |
| | Large livestock (cows) | \(  0.03\)^{*}  | \(  0.05\)^{***}  | \(  0.03\)  | \(  0.01\)  | \(  0.02\)  | \(  0.04\)^{*}  |
 |  | $N=1306$  | (\(  0.02\))    | (\(  0.02\))    | (\(  0.02\))    | (\(  0.02\))    | (\(  0.02\))    | (\(  0.02\))  |
| | Limited portions | \( -0.01\)  | \( -0.00\)  | \(  0.03\)  | \( -0.01\)  | \(  0.01\)  | \(  0.01\)  |
 |  | $N=1292$  | (\(  0.02\))    | (\(  0.02\))    | (\(  0.03\))    | (\(  0.03\))    | (\(  0.04\))    | (\(  0.04\))  |
| | Milk (last three days) | \(  0.00\)  | \( -0.00\)  | \(  0.00\)  | \( -0.04\)^{**}  | \(  0.05\)  | \(  0.04\)  |
 |  | $N=1285$  | (\(  0.02\))    | (\(  0.02\))    | (\(  0.02\))    | (\(  0.02\))    | (\(  0.03\))    | (\(  0.03\))  |
| | Mobile phone | \(  0.11\)^{***}  | \( -0.02\)  | \(  0.07\)  | \(  0.11\)^{***}  | \( -0.00\)  | \( -0.12\)^{**}  |
 |  | $N=1306$  | (\(  0.04\))    | (\(  0.04\))    | (\(  0.05\))    | (\(  0.04\))    | (\(  0.05\))    | (\(  0.05\))  |
| | Mosquito net | \( -0.06\)  | \(  0.00\)  | \( -0.02\)  | \(  0.11\)^{**}  | \( -0.18\)^{***}  | \( -0.11\)  |
 |  | $N=1306$  | (\(  0.04\))    | (\(  0.04\))    | (\(  0.05\))    | (\(  0.05\))    | (\(  0.07\))    | (\(  0.07\))  |
| | Motorcycle | \( -0.02\)  | \(  0.01\)  | \( -0.04\)  | \(  0.02\)  | \( -0.05\)  | \( -0.01\)  |
 |  | $N=1306$  | (\(  0.02\))    | (\(  0.03\))    | (\(  0.02\))    | (\(  0.03\))    | (\(  0.04\))    | (\(  0.04\))  |
| | No food in house | \( -0.01\)  | \( -0.00\)  | \( -0.00\)  | \( -0.01\)  | \(  0.00\)  | \(  0.01\)  |
 |  | $N=1293$  | (\(  0.01\))    | (\(  0.02\))    | (\(  0.01\))    | (\(  0.03\))    | (\(  0.03\))    | (\(  0.03\))  |
| | No preferred | \( -0.00\)  | \(  0.02\)  | \(  0.01\)  | \( -0.05\)  | \(  0.04\)  | \(  0.07\)  |
 |  | $N=1297$  | (\(  0.03\))    | (\(  0.03\))    | (\(  0.03\))    | (\(  0.05\))    | (\(  0.05\))    | (\(  0.06\))  |
| | Oil (last three days) | \( -0.01\)  | \(  0.04\)  | \( -0.00\)  | \(  0.03\)  | \( -0.04\)  | \(  0.01\)  |
 |  | $N=1285$  | (\(  0.02\))    | (\(  0.03\))    | (\(  0.02\))    | (\(  0.04\))    | (\(  0.04\))    | (\(  0.05\))  |
| | Other food (last three days) | \( -0.05\)^{*}  | \( -0.05\)  | \(  0.07\)  | \( -0.03\)  | \( -0.02\)  | \( -0.02\)  |
 |  | $N=1306$  | (\(  0.03\))    | (\(  0.04\))    | (\(  0.05\))    | (\(  0.06\))    | (\(  0.06\))    | (\(  0.07\))  |
| | Other non-food (last year) | \( -0.03\)^{**}  | \(  0.00\)  | \( -0.02\)^{*}  | \(  0.00\)  | \( -0.03\)^{**}  | \( -0.00\)  |
 |  | $N=1306$  | (\(  0.01\))    | (\(  0.00\))    | (\(  0.01\))    | (\(  0.00\))    | (\(  0.01\))    | (\(  0.00\))  |
| | Poultry | \(  0.02\)  | \(  0.04\)^{**}  | \( -0.01\)  | \(  0.01\)  | \(  0.01\)  | \(  0.04\)  |
 |  | $N=1285$  | (\(  0.02\))    | (\(  0.02\))    | (\(  0.02\))    | (\(  0.02\))    | (\(  0.03\))    | (\(  0.03\))  |
| | Radio | \(  0.01\)  | \( -0.01\)  | \( -0.01\)  | \(  0.04\)  | \( -0.03\)  | \( -0.06\)  |
 |  | $N=1306$  | (\(  0.05\))    | (\(  0.04\))    | (\(  0.06\))    | (\(  0.06\))    | (\(  0.07\))    | (\(  0.07\))  |
| | Rituals/ceremonies (last year) | \(  0.08\)^{**}  | \(  0.01\)  | \( -0.01\)  | \(  0.05\)  | \(  0.03\)  | \( -0.04\)  |
 |  | $N=1306$  | (\(  0.04\))    | (\(  0.03\))    | (\(  0.04\))    | (\(  0.04\))    | (\(  0.05\))    | (\(  0.05\))  |
| | Salt (last three days) | \( -0.00\)  | \( -0.02\)  | \(  0.00\)  | \( -0.04\)^{*}  | \(  0.04\)  | \(  0.03\)  |
 |  | $N=1285$  | (\(  0.01\))    | (\(  0.02\))    | (\(  0.01\))    | (\(  0.02\))    | (\(  0.03\))    | (\(  0.03\))  |
| | Small livestock | \(  0.09\)^{***}  | \(  0.16\)^{***}  | \( -0.02\)  | \(  0.10\)^{**}  | \( -0.01\)  | \(  0.06\)  |
 |  | $N=1306$  | (\(  0.03\))    | (\(  0.04\))    | (\(  0.04\))    | (\(  0.05\))    | (\(  0.06\))    | (\(  0.06\))  |
| | Spices (last three days) | \(  0.06\)  | \( -0.06\)^{**}  | \(  0.12\)^{**}  | \( -0.03\)  | \(  0.08\)  | \( -0.03\)  |
 |  | $N=1285$  | (\(  0.04\))    | (\(  0.02\))    | (\(  0.05\))    | (\(  0.03\))    | (\(  0.05\))    | (\(  0.04\))  |
| | Sugar (last three days) | \(  0.00\)  | \( -0.07\)^{**}  | \( -0.01\)  | \(  0.03\)  | \( -0.03\)  | \( -0.11\)^{**}  |
 |  | $N=1285$  | (\(  0.02\))    | (\(  0.03\))    | (\(  0.03\))    | (\(  0.04\))    | (\(  0.04\))    | (\(  0.05\))  |
| | Textiles (last year) | \(  0.01\)  | \( -0.01\)  | \(  0.17\)^{***}  | \(  0.12\)^{**}  | \( -0.11\)  | \( -0.13\)^{*}  |
 |  | $N=1306$  | (\(  0.05\))    | (\(  0.04\))    | (\(  0.06\))    | (\(  0.05\))    | (\(  0.07\))    | (\(  0.07\))  |
| | Toiletries (last month) | \( -0.01\)  | \(  0.02\)  | \( -0.05\)^{**}  | \( -0.00\)  | \( -0.01\)  | \(  0.02\)  |
 |  | $N=1306$  | (\(  0.01\))    | (\(  0.02\))    | (\(  0.02\))    | (\(  0.02\))    | (\(  0.03\))    | (\(  0.03\))  |
| | Transportation (last month) | \(  0.14\)^{***}  | \( -0.01\)  | \(  0.02\)  | \(  0.02\)  | \(  0.12\)^{**}  | \( -0.03\)  |
 |  | $N=1306$  | (\(  0.04\))    | (\(  0.04\))    | (\(  0.04\))    | (\(  0.05\))    | (\(  0.06\))    | (\(  0.06\))  |
| | Utensils (last year) | \(  0.03\)  | \( -0.04\)  | \(  0.13\)^{**}  | \(  0.07\)  | \( -0.04\)  | \( -0.12\)^{*}  |
 |  | $N=1306$  | (\(  0.05\))    | (\(  0.04\))    | (\(  0.06\))    | (\(  0.05\))    | (\(  0.07\))    | (\(  0.07\))  |
| | Vegetables (last three days) | \( -0.00\)  | \( -0.00\)  | \( -0.04\)  | \(  0.03\)  | \( -0.03\)  | \( -0.03\)  |
 |  | $N=1285$  | (\(  0.02\))    | (\(  0.03\))    | (\(  0.03\))    | (\(  0.03\))    | (\(  0.04\))    | (\(  0.04\))  |
| | Went hungry | \(  0.01\)  | \(  0.00\)  | \( -0.01\)  | \( -0.02\)  | \(  0.03\)  | \(  0.02\)  |
 |  | $N=1297$  | (\(  0.01\))    | (\(  0.02\))    | (\(  0.01\))    | (\(  0.03\))    | (\(  0.03\))    | (\(  0.04\))  |
| | Whole day without eating | \(  0.01\)  | \(  0.00\)  | \( -0.01\)  | \( -0.03\)  | \(  0.04\)  | \(  0.03\)  |
 |  | $N=1282$  | (\(  0.01\))    | (\(  0.02\))    | (\(  0.02\))    | (\(  0.03\))    | (\(  0.03\))    | (\(  0.04\))  |
| | Worried | \(  0.10\)^{**}  | \(  0.03\)  | \( -0.01\)  | \( -0.02\)  | \(  0.11\)^{*}  | \(  0.05\)  |
 |  | $N=1291$  | (\(  0.04\))    | (\(  0.04\))    | (\(  0.06\))    | (\(  0.05\))    | (\(  0.07\))    | (\(  0.06\))  |
| | airtime | \(  0.13\)^{***}  | \(  0.02\)  | \(  0.10\)^{**}  | \(  0.10\)^{***}  | \(  0.03\)  | \( -0.08\)^{*}  |
 |  | $N=1306$  | (\(  0.04\))    | (\(  0.03\))    | (\(  0.05\))    | (\(  0.04\))    | (\(  0.05\))    | (\(  0.05\))  |
| | axes | \( -0.11\)^{***}  | \( -0.05\)  | \( -0.09\)^{*}  | \( -0.00\)  | \( -0.11\)  | \( -0.04\)  |
 |  | $N=1306$  | (\(  0.04\))    | (\(  0.04\))    | (\(  0.05\))    | (\(  0.05\))    | (\(  0.07\))    | (\(  0.06\))  |
| | batteries | \( -0.04\)  | \( -0.08\)^{*}  | \(  0.04\)  | \(  0.00\)  | \( -0.04\)  | \( -0.08\)  |
 |  | $N=1306$  | (\(  0.04\))    | (\(  0.04\))    | (\(  0.05\))    | (\(  0.05\))    | (\(  0.07\))    | (\(  0.07\))  |
| | bread | \(  0.03\)  | \( -0.01\)  | \( -0.04\)  | \( -0.03\)  | \(  0.06\)  | \(  0.02\)  |
 |  | $N=1285$  | (\(  0.04\))    | (\(  0.04\))    | (\(  0.06\))    | (\(  0.06\))    | (\(  0.07\))    | (\(  0.07\))  |
| | carts | \(  0.00\)  | \( -0.01\)  | \(  0.00\)  | \(  0.01\)  | \( -0.01\)  | \( -0.02\)  |
 |  | $N=1306$  | (\(  0.00\))    | (\(  0.01\))    | (\(  0.00\))    | (\(  0.02\))    | (\(  0.02\))    | (\(  0.02\))  |
| | charcoal | \( -0.09\)^{**}  | \( -0.03\)  | \( -0.09\)^{*}  | \( -0.06\)  | \( -0.04\)  | \(  0.02\)  |
 |  | $N=1306$  | (\(  0.04\))    | (\(  0.04\))    | (\(  0.05\))    | (\(  0.05\))    | (\(  0.06\))    | (\(  0.06\))  |
| | chickens | \(  0.04\)  | \(  0.07\)^{**}  | \( -0.02\)  | \(  0.10\)^{**}  | \( -0.06\)  | \( -0.03\)  |
 |  | $N=1306$  | (\(  0.04\))    | (\(  0.04\))    | (\(  0.05\))    | (\(  0.05\))    | (\(  0.06\))    | (\(  0.06\))  |
| | childcare | \(  0.05\)  | \( -0.03\)  | \(  0.01\)  | \(  0.06\)  | \( -0.01\)  | \( -0.09\)  |
 |  | $N=1306$  | (\(  0.05\))    | (\(  0.04\))    | (\(  0.06\))    | (\(  0.05\))    | (\(  0.07\))    | (\(  0.07\))  |
| | childrensclothes | \( -0.02\)  | \( -0.02\)  | \( -0.06\)^{*}  | \( -0.01\)  | \( -0.01\)  | \( -0.01\)  |
 |  | $N=1306$  | (\(  0.03\))    | (\(  0.03\))    | (\(  0.04\))    | (\(  0.04\))    | (\(  0.05\))    | (\(  0.06\))  |
| | church | \(  0.00\)  | \(  0.00\)  | \(  0.00\)^{***}  | \( -0.03\)  | \(  0.03\)  | \(  0.04\)  |
 |  | $N=700$  | (\(  0.00\))    | (\(  0.03\))    | (\(  0.00\))    | (\(  0.04\))    | (\(  0.04\))    | (\(  0.05\))  |
| | ducks | \(  0.43\)^{***}  | \(  0.43\)^{***}  | \(  0.01\)  | \(  0.03\)  | \(  0.40\)^{***}  | \(  0.40\)^{***}  |
 |  | $N=1306$  | (\(  0.04\))    | (\(  0.04\))    | (\(  0.04\))    | (\(  0.04\))    | (\(  0.06\))    | (\(  0.06\))  |
| | durables | \( -0.00\)  | \( -0.00\)^{***}  | \(  0.15\)^{***}  | \(  0.00\)  | \( -0.00\)  | \( -0.00\)^{***}  |
 |  | $N=606$  | (\(  0.04\))    | (\(  0.00\))    | (\(  0.06\))    | (\(  0.00\))    | (\(  0.04\))    | (\(  0.00\))  |
| | fan | \(  0.02\)  | \(  0.00\)  | \( -0.02\)  | \( -0.01\)  | \(  0.03\)  | \(  0.01\)  |
 |  | $N=1306$  | (\(  0.02\))    | (\(  0.02\))    | (\(  0.02\))    | (\(  0.02\))    | (\(  0.03\))    | (\(  0.03\))  |
| | farm_income_yearly_sum | \(  0.00\)  | \( -0.00\)  | \( -0.00\)^{***}  | \(  0.01\)  | \( -0.01\)  | \( -0.01\)  |
 |  | $N=544$  | (\(  0.00\))    | (\(  0.01\))    | (\(  0.00\))    | (\(  0.00\))    | (\(  0.00\))    | (\(  0.01\))  |
| | funerals | \( -0.05\)  | \(  0.05\)  | \( -0.05\)  | \(  0.14\)^{**}  | \( -0.19\)^{***}  | \( -0.09\)  |
 |  | $N=1306$  | (\(  0.04\))    | (\(  0.04\))    | (\(  0.05\))    | (\(  0.05\))    | (\(  0.07\))    | (\(  0.07\))  |
| | homeimprovement | \(  0.08\)^{*}  | \( -0.01\)  | \( -0.09\)^{**}  | \( -0.02\)  | \(  0.10\)^{*}  | \(  0.01\)  |
 |  | $N=1306$  | (\(  0.04\))    | (\(  0.03\))    | (\(  0.04\))    | (\(  0.03\))    | (\(  0.05\))    | (\(  0.04\))  |
| | land_communitycult | \(  0.01\)  | \( -0.04\)  | \( -0.02\)^{**}  | \(  0.01\)  | \( -0.00\)  | \( -0.05\)  |
 |  | $N=938$  | (\(  0.02\))    | (\(  0.03\))    | (\(  0.01\))    | (\(  0.04\))    | (\(  0.04\))    | (\(  0.05\))  |
| | land_owncult | \( -0.03\)  | \(  0.02\)  | \( -0.03\)  | \(  0.04\)  | \( -0.07\)  | \( -0.02\)  |
 |  | $N=1224$  | (\(  0.03\))    | (\(  0.03\))    | (\(  0.04\))    | (\(  0.04\))    | (\(  0.06\))    | (\(  0.06\))  |
| | land_ownnocult | \(  0.13\)^{***}  | \(  0.05\)  | \(  0.05\)  | \(  0.06\)  | \(  0.06\)  | \( -0.02\)  |
 |  | $N=1035$  | (\(  0.04\))    | (\(  0.05\))    | (\(  0.05\))    | (\(  0.06\))    | (\(  0.07\))    | (\(  0.07\))  |
| | land_ownrent | \(  0.00\)  | \(  0.02\)  | \( -0.02\)^{**}  | \(  0.02\)  | \( -0.02\)  | \( -0.01\)  |
 |  | $N=944$  | (\(  0.01\))    | (\(  0.02\))    | (\(  0.01\))    | (\(  0.03\))    | (\(  0.03\))    | (\(  0.03\))  |
| | land_rentcult | \( -0.00\)  | \(  0.02\)  | \( -0.01\)  | \(  0.05\)^{*}  | \( -0.06\)^{*}  | \( -0.03\)  |
 |  | $N=945$  | (\(  0.01\))    | (\(  0.02\))    | (\(  0.02\))    | (\(  0.03\))    | (\(  0.03\))    | (\(  0.04\))  |
| | livestock | \(  0.02\)  | \(  0.00\)  | \(  0.00\)  | \(  0.07\)  | \( -0.05\)  | \( -0.06\)  |
 |  | $N=1285$  | (\(  0.04\))    | (\(  0.03\))    | (\(  0.05\))    | (\(  0.05\))    | (\(  0.06\))    | (\(  0.06\))  |
| | livestock_income_yearly_sum | \(  0.00\)  | \(  0.37\)^{***}  | \(  0.00\)^{***}  | \(  0.15\)^{**}  | \( -0.15\)^{**}  | \(  0.22\)^{***}  |
 |  | $N=544$  | (\(  0.00\))    | (\(  0.04\))    | (\(  0.00\))    | (\(  0.06\))    | (\(  0.06\))    | (\(  0.08\))  |
| | maize | \(  0.04\)  | \(  0.02\)  | \( -0.10\)^{*}  | \(  0.02\)  | \(  0.03\)  | \(  0.01\)  |
 |  | $N=1285$  | (\(  0.04\))    | (\(  0.04\))    | (\(  0.06\))    | (\(  0.05\))    | (\(  0.07\))    | (\(  0.06\))  |
| | medicine | \(  0.01\)  | \(  0.01\)  | \( -0.06\)^{*}  | \(  0.04\)  | \( -0.03\)  | \( -0.03\)  |
 |  | $N=1306$  | (\(  0.03\))    | (\(  0.03\))    | (\(  0.04\))    | (\(  0.03\))    | (\(  0.04\))    | (\(  0.04\))  |
| | millet | \(  0.06\)^{**}  | \( -0.01\)  | \(  0.01\)  | \( -0.01\)  | \(  0.08\)^{**}  | \(  0.00\)  |
 |  | $N=1285$  | (\(  0.03\))    | (\(  0.02\))    | (\(  0.03\))    | (\(  0.02\))    | (\(  0.04\))    | (\(  0.03\))  |
| | nuts | \(  0.02\)  | \( -0.08\)^{**}  | \( -0.01\)  | \(  0.03\)  | \( -0.01\)  | \( -0.12\)^{*}  |
 |  | $N=1285$  | (\(  0.03\))    | (\(  0.04\))    | (\(  0.04\))    | (\(  0.05\))    | (\(  0.06\))    | (\(  0.07\))  |
| | othermonth | \( -0.03\)^{***}  | \(  0.01\)  | \( -0.02\)  | \(  0.02\)  | \( -0.05\)^{**}  | \( -0.01\)  |
 |  | $N=1306$  | (\(  0.01\))    | (\(  0.01\))    | (\(  0.02\))    | (\(  0.02\))    | (\(  0.02\))    | (\(  0.02\))  |
| | pangas | \(  0.05\)  | \( -0.03\)  | \( -0.02\)  | \( -0.09\)  | \(  0.14\)^{*}  | \(  0.06\)  |
 |  | $N=1306$  | (\(  0.04\))    | (\(  0.04\))    | (\(  0.06\))    | (\(  0.05\))    | (\(  0.07\))    | (\(  0.07\))  |
| | plough | \(  0.02\)  | \( -0.01\)  | \( -0.00\)  | \( -0.02\)  | \(  0.04\)^{*}  | \(  0.01\)  |
 |  | $N=1306$  | (\(  0.01\))    | (\(  0.01\))    | (\(  0.01\))    | (\(  0.02\))    | (\(  0.02\))    | (\(  0.02\))  |
| | ploughs_again | \(  0.00\)  | \(  0.00\)  | \( -0.00\)  | \(  0.00\)  | \(  0.00\)  | \( -0.00\)  |
 |  | $N=1306$  | (\(  0.01\))    | (\(  0.00\))    | (\(  0.02\))    | (\(  0.00\))    | (\(  0.01\))    | (\(  0.00\))  |
| | potato | \(  0.05\)^{**}  | \(  0.00\)  | \(  0.01\)  | \(  0.04\)^{*}  | \(  0.01\)  | \( -0.03\)  |
 |  | $N=1285$  | (\(  0.02\))    | (\(  0.01\))    | (\(  0.02\))    | (\(  0.02\))    | (\(  0.03\))    | (\(  0.02\))  |
| | potspans | \( -0.05\)  | \( -0.05\)^{*}  | \( -0.03\)  | \( -0.06\)  | \(  0.01\)  | \(  0.00\)  |
 |  | $N=1306$  | (\(  0.04\))    | (\(  0.03\))    | (\(  0.05\))    | (\(  0.04\))    | (\(  0.06\))    | (\(  0.05\))  |
| | rice | \( -0.04\)  | \( -0.08\)^{**}  | \( -0.00\)  | \(  0.04\)  | \( -0.08\)  | \( -0.12\)^{*}  |
 |  | $N=1285$  | (\(  0.04\))    | (\(  0.04\))    | (\(  0.05\))    | (\(  0.05\))    | (\(  0.07\))    | (\(  0.07\))  |
| | savings_BRAC | \(  0.45\)^{***}  | \(  0.36\)^{***}  | \( -0.01\)  | \(  0.02\)  | \(  0.43\)^{***}  | \(  0.34\)^{***}  |
 |  | $N=1306$  | (\(  0.04\))    | (\(  0.03\))    | (\(  0.02\))    | (\(  0.03\))    | (\(  0.04\))    | (\(  0.04\))  |
| | savings_NGOs | \( -0.00\)  | \(  0.00\)  | \( -0.00\)  | \( -0.00\)  | \(  0.00\)  | \(  0.00\)  |
 |  | $N=1306$  | (\(  0.00\))    | (\(  0.00\))    | (\(  0.00\))    | (\(  0.00\))    | (\(  0.00\))    | (\(  0.00\))  |
| | savings_bank | \(  0.02\)  | \(  0.01\)  | \( -0.01\)  | \(  0.02\)  | \( -0.00\)  | \( -0.01\)  |
 |  | $N=1306$  | (\(  0.01\))    | (\(  0.01\))    | (\(  0.00\))    | (\(  0.01\))    | (\(  0.02\))    | (\(  0.02\))  |
| | savings_home | \( -0.14\)^{***}  | \( -0.07\)^{*}  | \( -0.05\)  | \(  0.01\)  | \( -0.15\)^{**}  | \( -0.08\)  |
 |  | $N=1306$  | (\(  0.04\))    | (\(  0.04\))    | (\(  0.06\))    | (\(  0.05\))    | (\(  0.07\))    | (\(  0.07\))  |
| | savings_maize_val | \(  0.04\)  | \( -0.02\)  | \(  0.01\)  | \( -0.02\)  | \(  0.05\)  | \( -0.00\)  |
 |  | $N=1306$  | (\(  0.04\))    | (\(  0.03\))    | (\(  0.06\))    | (\(  0.04\))    | (\(  0.06\))    | (\(  0.05\))  |
| | savings_other | \( -0.00\)  | \( -0.01\)  | \( -0.01\)  | \( -0.01\)  | \(  0.01\)  | \(  0.00\)  |
 |  | $N=1306$  | (\(  0.01\))    | (\(  0.02\))    | (\(  0.00\))    | (\(  0.02\))    | (\(  0.02\))    | (\(  0.03\))  |
| | savings_otherfood1_val | \(  0.01\)  | \(  0.01\)  | \( -0.02\)  | \( -0.07\)  | \(  0.09\)  | \(  0.09\)  |
 |  | $N=1306$  | (\(  0.05\))    | (\(  0.04\))    | (\(  0.06\))    | (\(  0.06\))    | (\(  0.07\))    | (\(  0.07\))  |
| | savings_otherfood2_val | \(  0.00\)  | \(  0.00\)  | \( -0.01\)  | \( -0.01\)  | \(  0.01\)  | \(  0.01\)  |
 |  | $N=1306$  | (\(  0.01\))    | (\(  0.01\))    | (\(  0.02\))    | (\(  0.02\))    | (\(  0.02\))    | (\(  0.02\))  |
| | savings_sorghum_val | \( -0.02\)  | \(  0.02\)  | \(  0.04\)  | \(  0.09\)^{**}  | \( -0.11\)^{*}  | \( -0.07\)  |
 |  | $N=1306$  | (\(  0.04\))    | (\(  0.03\))    | (\(  0.06\))    | (\(  0.04\))    | (\(  0.06\))    | (\(  0.05\))  |
| | sewing | \(  0.01\)  | \(  0.03\)^{*}  | \( -0.06\)^{**}  | \(  0.01\)  | \(  0.00\)  | \(  0.02\)  |
 |  | $N=1306$  | (\(  0.03\))    | (\(  0.02\))    | (\(  0.02\))    | (\(  0.02\))    | (\(  0.03\))    | (\(  0.03\))  |
| | shed | \(  0.10\)^{***}  | \(  0.08\)^{***}  | \(  0.03\)  | \(  0.02\)  | \(  0.08\)^{*}  | \(  0.05\)  |
 |  | $N=1306$  | (\(  0.03\))    | (\(  0.02\))    | (\(  0.03\))    | (\(  0.03\))    | (\(  0.04\))    | (\(  0.04\))  |
| | shoes | \(  0.04\)  | \(  0.04\)  | \(  0.01\)  | \( -0.02\)  | \(  0.05\)  | \(  0.06\)  |
 |  | $N=1306$  | (\(  0.03\))    | (\(  0.03\))    | (\(  0.04\))    | (\(  0.05\))    | (\(  0.05\))    | (\(  0.06\))  |
| | shop | \(  0.02\)  | \(  0.00\)  | \(  0.01\)  | \( -0.02\)  | \(  0.04\)  | \(  0.02\)  |
 |  | $N=1306$  | (\(  0.02\))    | (\(  0.02\))    | (\(  0.03\))    | (\(  0.02\))    | (\(  0.03\))    | (\(  0.03\))  |
| | sorghum | \(  0.07\)^{*}  | \(  0.02\)  | \(  0.14\)^{**}  | \(  0.08\)  | \( -0.01\)  | \( -0.06\)  |
 |  | $N=1285$  | (\(  0.04\))    | (\(  0.04\))    | (\(  0.06\))    | (\(  0.05\))    | (\(  0.07\))    | (\(  0.06\))  |
| | source1 | \(  0.00\)  | \(  0.05\)  | \(  0.00\)^{**}  | \(  0.06\)  | \( -0.06\)  | \( -0.02\)  |
 |  | $N=656$  | (\(  0.00\))    | (\(  0.03\))    | (\(  0.00\))    | (\(  0.04\))    | (\(  0.04\))    | (\(  0.05\))  |
| | source2 | \(  0.00\)  | \( -0.02\)  | \(  0.00\)  | \( -0.02\)  | \(  0.02\)  | \( -0.00\)  |
 |  | $N=656$  | (\(  0.00\))    | (\(  0.04\))    | (\(  0.00\))    | (\(  0.05\))    | (\(  0.05\))    | (\(  0.07\))  |
| | source3 | \(  0.00\)  | \( -0.03\)^{**}  | \(  0.00\)^{**}  | \( -0.01\)  | \(  0.01\)  | \( -0.02\)  |
 |  | $N=656$  | (\(  0.00\))    | (\(  0.02\))    | (\(  0.00\))    | (\(  0.02\))    | (\(  0.02\))    | (\(  0.03\))  |
| | source4 | \(  0.00\)  | \( -0.01\)  | \(  0.00\)^{*}  | \( -0.02\)^{***}  | \(  0.02\)^{***}  | \(  0.01\)  |
 |  | $N=656$  | (\(  0.00\))    | (\(  0.01\))    | (\(  0.00\))    | (\(  0.01\))    | (\(  0.01\))    | (\(  0.01\))  |
| | source5 | \(  0.00\)  | \(  0.00\)  | \( -0.00\)  | \( -0.00\)  | \(  0.00\)  | \(  0.00\)  |
 |  | $N=656$  | (\(  0.00\))    | (\(  0.01\))    | (\(  0.00\))    | (\(  0.00\))    | (\(  0.00\))    | (\(  0.01\))  |
| | stoves | \( -0.09\)^{**}  | \(  0.03\)  | \(  0.05\)  | \( -0.01\)  | \( -0.07\)  | \(  0.04\)  |
 |  | $N=1306$  | (\(  0.04\))    | (\(  0.03\))    | (\(  0.05\))    | (\(  0.03\))    | (\(  0.05\))    | (\(  0.04\))  |
| | sweetpotato | \(  0.12\)^{***}  | \(  0.02\)  | \( -0.02\)  | \(  0.00\)  | \(  0.12\)^{***}  | \(  0.02\)  |
 |  | $N=1285$  | (\(  0.03\))    | (\(  0.01\))    | (\(  0.03\))    | (\(  0.01\))    | (\(  0.03\))    | (\(  0.02\))  |
| | tea | \(  0.09\)^{**}  | \( -0.04\)  | \(  0.07\)  | \( -0.02\)  | \(  0.11\)^{*}  | \( -0.02\)  |
 |  | $N=1285$  | (\(  0.04\))    | (\(  0.04\))    | (\(  0.04\))    | (\(  0.05\))    | (\(  0.06\))    | (\(  0.07\))  |
| | tobacco | \(  0.04\)^{*}  | \( -0.02\)  | \(  0.04\)  | \( -0.05\)^{***}  | \(  0.09\)^{***}  | \(  0.02\)  |
 |  | $N=1306$  | (\(  0.02\))    | (\(  0.02\))    | (\(  0.03\))    | (\(  0.02\))    | (\(  0.03\))    | (\(  0.02\))  |
| | transfers_give1 | \(  0.04\)  | \(  0.02\)  | \(  0.00\)  | \( -0.01\)  | \(  0.05\)  | \(  0.03\)  |
 |  | $N=1306$  | (\(  0.03\))    | (\(  0.03\))    | (\(  0.04\))    | (\(  0.03\))    | (\(  0.05\))    | (\(  0.04\))  |
| | transfers_give2 | \(  0.01\)  | \( -0.01\)  | \( -0.01\)  | \( -0.00\)  | \(  0.01\)  | \( -0.00\)  |
 |  | $N=1306$  | (\(  0.02\))    | (\(  0.01\))    | (\(  0.02\))    | (\(  0.01\))    | (\(  0.02\))    | (\(  0.01\))  |
| | transfers_give3 | \( -0.01\)  | \( -0.00\)  | \( -0.01\)  | \( -0.00\)  | \( -0.00\)  | \(  0.00\)  |
 |  | $N=1306$  | (\(  0.01\))    | (\(  0.00\))    | (\(  0.01\))    | (\(  0.00\))    | (\(  0.01\))    | (\(  0.00\))  |
| | tv | \( -0.04\)^{**}  | \(  0.01\)  | \( -0.04\)^{*}  | \( -0.02\)  | \( -0.02\)  | \(  0.04\)  |
 |  | $N=1306$  | (\(  0.02\))    | (\(  0.02\))    | (\(  0.02\))    | (\(  0.02\))    | (\(  0.03\))    | (\(  0.03\))  |
| | womensclothes | \(  0.07\)^{*}  | \( -0.04\)  | \(  0.11\)^{**}  | \(  0.02\)  | \(  0.06\)  | \( -0.05\)  |
 |  | $N=1306$  | (\(  0.04\))    | (\(  0.04\))    | (\(  0.05\))    | (\(  0.05\))    | (\(  0.07\))    | (\(  0.07\))  |
| Log Values |  Meat (last three days) | \(  0.10\)  | \(  0.11\)  | \(  0.02\)  | \(  0.24\)  | \( -0.14\)  | \( -0.13\)  |
 |  | $N=363$  | (\(  0.14\))    | (\(  0.14\))    | (\(  0.14\))    | (\(  0.16\))    | (\(  0.21\))    | (\(  0.21\))  |
| | Alcohol (last three days) | \(  0.78\)^{*}  | \(  1.24\)^{*}  | \(  0.45\)  | \(  1.54\)^{**}  | \( -0.77\)  | \( -0.30\)  |
 |  | $N=40$  | (\(  0.44\))    | (\(  0.73\))    | (\(  0.61\))    | (\(  0.65\))    | (\(  0.78\))    | (\(  0.98\))  |
| | Ate unpreferred | \( -0.01\)  | \(  0.01\)  | \(  0.06\)  | \( -0.04\)  | \(  0.02\)  | \(  0.04\)  |
 |  | $N=1177$  | (\(  0.03\))    | (\(  0.03\))    | (\(  0.04\))    | (\(  0.05\))    | (\(  0.06\))    | (\(  0.06\))  |
| | Beans (last three days) | \(  0.13\)^{***}  | \( -0.02\)  | \( -0.05\)  | \(  0.09\)  | \(  0.04\)  | \( -0.12\)  |
 |  | $N=983$  | (\(  0.05\))    | (\(  0.06\))    | (\(  0.06\))    | (\(  0.07\))    | (\(  0.09\))    | (\(  0.09\))  |
| | Bed | \(  0.16\)  | \(  0.04\)  | \(  0.04\)  | \( -0.17\)  | \(  0.32\)^{**}  | \(  0.21\)  |
 |  | $N=1173$  | (\(  0.11\))    | (\(  0.09\))    | (\(  0.13\))    | (\(  0.10\))    | (\(  0.15\))    | (\(  0.14\))  |
| | Bicycle | \(  0.14\)  | \( -0.08\)  | \(  0.22\)  | \( -0.18\)  | \(  0.32\)  | \(  0.11\)  |
 |  | $N=246$  | (\(  0.18\))    | (\(  0.12\))    | (\(  0.18\))    | (\(  0.18\))    | (\(  0.25\))    | (\(  0.22\))  |
| | Cereals (last three days) | \(  0.28\)^{***}  | \( -0.08\)  | \( -0.10\)  | \(  0.17\)  | \(  0.12\)  | \( -0.24\)  |
 |  | $N=1183$  | (\(  0.08\))    | (\(  0.10\))    | (\(  0.09\))    | (\(  0.11\))    | (\(  0.14\))    | (\(  0.15\))  |
| | Chair/table | \(  0.14\)  | \(  0.04\)  | \( -0.03\)  | \( -0.04\)  | \(  0.18\)  | \(  0.08\)  |
 |  | $N=1215$  | (\(  0.09\))    | (\(  0.10\))    | (\(  0.11\))    | (\(  0.11\))    | (\(  0.14\))    | (\(  0.15\))  |
| | Charities (last year) | \(  0.95\)^{***}  | \(  0.00\)  | \(  0.07\)  | \( -0.00\)  | \(  0.95\)^{***}  | \(  0.00\)  |
 |  | $N=192$  | (\(  0.21\))    | (\(  0.00\))    | (\(  0.31\))    | (\(  0.00\))    | (\(  0.21\))    | (\(  0.00\))  |
| | Clothing, footwear (last year) | \(  0.22\)  | \( -0.04\)  | \( -0.13\)  | \( -0.31\)^{**}  | \(  0.53\)^{**}  | \(  0.27\)  |
 |  | $N=856$  | (\(  0.17\))    | (\(  0.14\))    | (\(  0.20\))    | (\(  0.16\))    | (\(  0.23\))    | (\(  0.21\))  |
| | Cooking fuel (last month) | \(  0.12\)  | \( -0.02\)  | \( -0.08\)  | \( -0.07\)  | \(  0.19\)  | \(  0.05\)  |
 |  | $N=1209$  | (\(  0.10\))    | (\(  0.07\))    | (\(  0.12\))    | (\(  0.10\))    | (\(  0.14\))    | (\(  0.12\))  |
| | Cosmetics (last month) | \(  0.30\)^{***}  | \( -0.04\)  | \( -0.15\)  | \(  0.03\)  | \(  0.27\)^{**}  | \( -0.07\)  |
 |  | $N=1060$  | (\(  0.09\))    | (\(  0.08\))    | (\(  0.09\))    | (\(  0.09\))    | (\(  0.13\))    | (\(  0.12\))  |
| | Dowry (last year) | \(  1.06\)  | \( -0.66\)  | \( -0.84\)  | \( -1.79\)^{***}  | \(  2.85\)^{***}  | \(  1.13\)  |
 |  | $N=107$  | (\(  0.86\))    | (\(  0.77\))    | (\(  0.98\))    | (\(  0.68\))    | (\(  1.09\))    | (\(  1.02\))  |
| | Egg (last three days) | \(  0.09\)  | \(  0.26\)^{*}  | \( -0.29\)  | \(  0.26\)  | \( -0.17\)  | \( -0.00\)  |
 |  | $N=183$  | (\(  0.10\))    | (\(  0.14\))    | (\(  0.19\))    | (\(  0.17\))    | (\(  0.19\))    | (\(  0.22\))  |
| | Entertainment (last month) | \(  0.20\)  | \( -0.12\)  | \(  0.34\)  | \(  0.00\)  | \(  0.20\)  | \( -0.12\)  |
 |  | $N=47$  | (\(  0.30\))    | (\(  1.22\))    | (\(  0.96\))    | (\(  0.00\))    | (\(  0.30\))    | (\(  1.22\))  |
| | Few kinds | \( -0.02\)  | \( -0.05\)  | \(  0.03\)  | \( -0.07\)  | \(  0.05\)  | \(  0.03\)  |
 |  | $N=1151$  | (\(  0.03\))    | (\(  0.04\))    | (\(  0.04\))    | (\(  0.05\))    | (\(  0.06\))    | (\(  0.06\))  |
| | Fewer Meals | \(  0.00\)  | \( -0.04\)  | \(  0.02\)  | \(  0.00\)  | \( -0.00\)  | \( -0.04\)  |
 |  | $N=1217$  | (\(  0.03\))    | (\(  0.03\))    | (\(  0.03\))    | (\(  0.04\))    | (\(  0.05\))    | (\(  0.06\))  |
| | Fish (last three days) | \(  0.11\)^{*}  | \( -0.04\)  | \( -0.06\)  | \(  0.00\)  | \(  0.11\)  | \( -0.04\)  |
 |  | $N=875$  | (\(  0.06\))    | (\(  0.06\))    | (\(  0.07\))    | (\(  0.07\))    | (\(  0.09\))    | (\(  0.09\))  |
| | Fruit (last three days) | \(  0.09\)  | \( -0.13\)  | \( -0.02\)  | \(  0.10\)  | \( -0.01\)  | \( -0.23\)  |
 |  | $N=339$  | (\(  0.13\))    | (\(  0.11\))    | (\(  0.17\))    | (\(  0.14\))    | (\(  0.19\))    | (\(  0.18\))  |
| | Furniture (last year) | \(  0.53\)^{**}  | \( -0.25\)  | \( -0.03\)  | \(  0.15\)  | \(  0.38\)  | \( -0.40\)  |
 |  | $N=200$  | (\(  0.21\))    | (\(  0.41\))    | (\(  0.23\))    | (\(  0.51\))    | (\(  0.55\))    | (\(  0.65\))  |
| | Large livestock (cows) | \( -0.02\)  | \(  0.08\)  | \( -1.25\)  | \( -0.56\)  | \(  0.53\)  | \(  0.64\)  |
 |  | $N=43$  | (\(  0.91\))    | (\(  0.61\))    | (\(  1.17\))    | (\(  1.18\))    | (\(  1.49\))    | (\(  1.33\))  |
| | Limited portions | \( -0.01\)  | \(  0.02\)  | \( -0.03\)  | \(  0.04\)  | \( -0.05\)  | \( -0.02\)  |
 |  | $N=1203$  | (\(  0.03\))    | (\(  0.03\))    | (\(  0.04\))    | (\(  0.04\))    | (\(  0.05\))    | (\(  0.06\))  |
| | Milk (last three days) | \(  0.33\)  | \(  0.19\)  | \(  0.09\)  | \(  0.05\)  | \(  0.27\)  | \(  0.14\)  |
 |  | $N=67$  | (\(  0.44\))    | (\(  0.29\))    | (\(  0.65\))    | (\(  0.74\))    | (\(  0.86\))    | (\(  0.79\))  |
| | Mobile phone | \( -0.06\)  | \(  0.11\)  | \( -0.22\)^{*}  | \(  0.05\)  | \( -0.11\)  | \(  0.06\)  |
 |  | $N=1008$  | (\(  0.08\))    | (\(  0.07\))    | (\(  0.12\))    | (\(  0.09\))    | (\(  0.13\))    | (\(  0.12\))  |
| | Mosquito net | \(  0.09\)  | \(  0.06\)  | \(  0.14\)  | \( -0.07\)  | \(  0.16\)  | \(  0.13\)  |
 |  | $N=852$  | (\(  0.08\))    | (\(  0.09\))    | (\(  0.10\))    | (\(  0.10\))    | (\(  0.13\))    | (\(  0.14\))  |
| | Motorcycle | \( -0.33\)  | \( -0.32\)  | \(  0.14\)  | \( -0.89\)  | \(  0.56\)  | \(  0.57\)  |
 |  | $N=102$  | (\(  0.39\))    | (\(  0.76\))    | (\(  0.42\))    | (\(  0.76\))    | (\(  0.86\))    | (\(  1.08\))  |
| | No food in house | \(  0.04\)^{*}  | \(  0.03\)  | \(  0.02\)  | \(  0.02\)  | \(  0.02\)  | \(  0.01\)  |
 |  | $N=1249$  | (\(  0.02\))    | (\(  0.03\))    | (\(  0.03\))    | (\(  0.04\))    | (\(  0.05\))    | (\(  0.05\))  |
| | No preferred | \( -0.02\)  | \( -0.00\)  | \(  0.03\)  | \( -0.08\)  | \(  0.06\)  | \(  0.07\)  |
 |  | $N=1116$  | (\(  0.03\))    | (\(  0.04\))    | (\(  0.04\))    | (\(  0.05\))    | (\(  0.06\))    | (\(  0.06\))  |
| | Oil (last three days) | \(  0.04\)  | \( -0.05\)  | \( -0.16\)^{**}  | \(  0.10\)  | \( -0.07\)  | \( -0.15\)^{*}  |
 |  | $N=1159$  | (\(  0.06\))    | (\(  0.05\))    | (\(  0.07\))    | (\(  0.06\))    | (\(  0.09\))    | (\(  0.08\))  |
| | Other food (last three days) | \( -0.22\)  | \( -0.04\)  | \(  0.20\)  | \( -0.03\)  | \( -0.19\)  | \( -0.01\)  |
 |  | $N=438$  | (\(  0.22\))    | (\(  0.12\))    | (\(  0.16\))    | (\(  0.14\))    | (\(  0.26\))    | (\(  0.18\))  |
| | Other non-food (last year) | \( -1.36\)  | \(  0.00\)  | \(  0.49\)  | \(  0.00\)  | \( -1.36\)  | \(  0.00\)  |
 |  | $N=11$  | (\(  1.41\))    | (\(  0.00\))    | (\(  1.96\))    | (\(  0.00\))    | (\(  1.41\))    | (\(  0.00\))  |
| | Poultry | \( -0.03\)  | \( -0.04\)  | \( -0.01\)  | \(  0.89\)  | \( -0.92\)  | \( -0.92\)  |
 |  | $N=55$  | (\(  0.72\))    | (\(  0.62\))    | (\(  1.39\))    | (\(  0.83\))    | (\(  1.09\))    | (\(  1.03\))  |
| | Radio | \( -0.00\)  | \(  0.02\)  | \(  0.04\)  | \( -0.01\)  | \(  0.01\)  | \(  0.03\)  |
 |  | $N=641$  | (\(  0.10\))    | (\(  0.10\))    | (\(  0.13\))    | (\(  0.13\))    | (\(  0.17\))    | (\(  0.17\))  |
| | Rituals/ceremonies (last year) | \(  0.77\)^{***}  | \( -0.29\)  | \(  0.58\)  | \(  0.09\)  | \(  0.68\)  | \( -0.38\)  |
 |  | $N=196$  | (\(  0.29\))    | (\(  0.37\))    | (\(  0.47\))    | (\(  0.40\))    | (\(  0.49\))    | (\(  0.54\))  |
| | Salt (last three days) | \( -0.01\)  | \(  0.08\)  | \( -0.02\)  | \(  0.09\)^{*}  | \( -0.11\)^{*}  | \( -0.02\)  |
 |  | $N=1255$  | (\(  0.02\))    | (\(  0.05\))    | (\(  0.02\))    | (\(  0.05\))    | (\(  0.06\))    | (\(  0.07\))  |
| | Small livestock | \(  0.48\)^{**}  | \( -0.05\)  | \(  0.18\)  | \( -0.27\)  | \(  0.75\)^{**}  | \(  0.22\)  |
 |  | $N=254$  | (\(  0.20\))    | (\(  0.20\))    | (\(  0.27\))    | (\(  0.21\))    | (\(  0.29\))    | (\(  0.29\))  |
| | Spices (last three days) | \(  0.09\)^{*}  | \(  0.15\)  | \( -0.10\)^{**}  | \( -0.12\)  | \(  0.21\)  | \(  0.27\)  |
 |  | $N=458$  | (\(  0.05\))    | (\(  0.18\))    | (\(  0.04\))    | (\(  0.15\))    | (\(  0.16\))    | (\(  0.23\))  |
| | Sugar (last three days) | \(  0.11\)^{*}  | \(  0.08\)  | \(  0.03\)  | \( -0.04\)  | \(  0.16\)^{*}  | \(  0.12\)  |
 |  | $N=1148$  | (\(  0.06\))    | (\(  0.06\))    | (\(  0.07\))    | (\(  0.07\))    | (\(  0.09\))    | (\(  0.09\))  |
| | Textiles (last year) | \(  0.29\)^{**}  | \( -0.09\)  | \( -0.34\)^{**}  | \(  0.02\)  | \(  0.28\)  | \( -0.11\)  |
 |  | $N=547$  | (\(  0.13\))    | (\(  0.14\))    | (\(  0.14\))    | (\(  0.16\))    | (\(  0.21\))    | (\(  0.22\))  |
| | Toiletries (last month) | \(  0.26\)^{***}  | \(  0.03\)  | \( -0.29\)^{***}  | \( -0.11\)  | \(  0.36\)^{***}  | \(  0.13\)  |
 |  | $N=1264$  | (\(  0.08\))    | (\(  0.07\))    | (\(  0.10\))    | (\(  0.09\))    | (\(  0.12\))    | (\(  0.11\))  |
| | Transportation (last month) | \( -0.09\)  | \(  0.19\)  | \( -0.11\)  | \(  0.11\)  | \( -0.20\)  | \(  0.09\)  |
 |  | $N=289$  | (\(  0.22\))    | (\(  0.20\))    | (\(  0.32\))    | (\(  0.23\))    | (\(  0.31\))    | (\(  0.30\))  |
| | Utensils (last year) | \(  0.19\)  | \(  0.13\)  | \(  0.19\)  | \( -0.21\)  | \(  0.41\)  | \(  0.34\)  |
 |  | $N=486$  | (\(  0.15\))    | (\(  0.17\))    | (\(  0.16\))    | (\(  0.20\))    | (\(  0.25\))    | (\(  0.27\))  |
| | Vegetables (last three days) | \(  0.15\)^{**}  | \(  0.09\)  | \( -0.21\)^{***}  | \(  0.14\)^{*}  | \(  0.02\)  | \( -0.05\)  |
 |  | $N=1181$  | (\(  0.06\))    | (\(  0.07\))    | (\(  0.08\))    | (\(  0.08\))    | (\(  0.10\))    | (\(  0.10\))  |
| | Went hungry | \(  0.04\)^{*}  | \( -0.01\)  | \(  0.04\)  | \( -0.03\)  | \(  0.07\)  | \(  0.02\)  |
 |  | $N=1247$  | (\(  0.02\))    | (\(  0.03\))    | (\(  0.03\))    | (\(  0.04\))    | (\(  0.05\))    | (\(  0.05\))  |
| | Whole day without eating | \(  0.01\)  | \( -0.02\)  | \(  0.02\)  | \( -0.03\)  | \(  0.04\)  | \(  0.00\)  |
 |  | $N=1229$  | (\(  0.02\))    | (\(  0.03\))    | (\(  0.03\))    | (\(  0.04\))    | (\(  0.05\))    | (\(  0.05\))  |
| | Worried | \( -0.02\)  | \(  0.05\)  | \( -0.02\)  | \( -0.02\)  | \( -0.01\)  | \(  0.06\)  |
 |  | $N=914$  | (\(  0.03\))    | (\(  0.04\))    | (\(  0.04\))    | (\(  0.05\))    | (\(  0.06\))    | (\(  0.07\))  |
| | airtime | \(  0.21\)  | \(  0.07\)  | \( -0.30\)^{**}  | \( -0.04\)  | \(  0.25\)  | \(  0.11\)  |
 |  | $N=1010$  | (\(  0.13\))    | (\(  0.09\))    | (\(  0.15\))    | (\(  0.11\))    | (\(  0.16\))    | (\(  0.14\))  |
| | axes | \(  0.14\)  | \( -0.02\)  | \(  0.06\)  | \( -0.27\)^{**}  | \(  0.41\)^{**}  | \(  0.25\)^{*}  |
 |  | $N=393$  | (\(  0.12\))    | (\(  0.09\))    | (\(  0.16\))    | (\(  0.11\))    | (\(  0.16\))    | (\(  0.14\))  |
| | batteries | \(  0.20\)^{**}  | \(  0.13\)  | \( -0.13\)  | \(  0.10\)  | \(  0.10\)  | \(  0.04\)  |
 |  | $N=765$  | (\(  0.09\))    | (\(  0.08\))    | (\(  0.11\))    | (\(  0.10\))    | (\(  0.13\))    | (\(  0.13\))  |
| | bread | \(  0.06\)  | \(  0.01\)  | \( -0.05\)  | \(  0.05\)  | \(  0.01\)  | \( -0.04\)  |
 |  | $N=695$  | (\(  0.07\))    | (\(  0.08\))    | (\(  0.08\))    | (\(  0.09\))    | (\(  0.12\))    | (\(  0.12\))  |
| | carts | \(  0.00\)  | \(  0.43\)  | \(  0.00\)  | \(  0.43\)^{*}  | \( -0.43\)^{*}  | \(  0.00\)  |
 |  | $N=11$  | (\(  0.00\))    | (\(  0.48\))    | (\(  0.00\))    | (\(  0.25\))    | (\(  0.25\))    | (\(  0.54\))  |
| | charcoal | \(  0.23\)^{*}  | \( -0.01\)  | \(  0.20\)  | \( -0.14\)  | \(  0.38\)^{*}  | \(  0.14\)  |
 |  | $N=371$  | (\(  0.12\))    | (\(  0.11\))    | (\(  0.14\))    | (\(  0.17\))    | (\(  0.21\))    | (\(  0.20\))  |
| | chickens | \(  0.26\)  | \(  0.07\)  | \( -0.23\)  | \(  0.09\)  | \(  0.17\)  | \( -0.01\)  |
 |  | $N=305$  | (\(  0.17\))    | (\(  0.18\))    | (\(  0.22\))    | (\(  0.21\))    | (\(  0.27\))    | (\(  0.28\))  |
| | childcare | \(  0.27\)^{*}  | \(  0.26\)^{*}  | \( -0.67\)^{***}  | \( -0.13\)  | \(  0.40\)^{*}  | \(  0.38\)  |
 |  | $N=587$  | (\(  0.15\))    | (\(  0.15\))    | (\(  0.21\))    | (\(  0.18\))    | (\(  0.23\))    | (\(  0.23\))  |
| | childrensclothes | \( -0.07\)  | \(  0.06\)  | \( -0.38\)^{***}  | \( -0.11\)  | \(  0.03\)  | \(  0.16\)  |
 |  | $N=1099$  | (\(  0.10\))    | (\(  0.08\))    | (\(  0.13\))    | (\(  0.13\))    | (\(  0.16\))    | (\(  0.15\))  |
| | church | \(  0.00\)  | \( -0.05\)  | \( -0.00\)^{***}  | \( -0.12\)  | \(  0.12\)  | \(  0.07\)  |
 |  | $N=607$  | (\(  0.00\))    | (\(  0.09\))    | (\(  0.00\))    | (\(  0.13\))    | (\(  0.13\))    | (\(  0.16\))  |
| | ducks | \(  0.60\)^{***}  | \(  0.38\)^{**}  | \( -0.24\)  | \( -0.08\)  | \(  0.68\)^{**}  | \(  0.46\)  |
 |  | $N=384$  | (\(  0.21\))    | (\(  0.18\))    | (\(  0.31\))    | (\(  0.27\))    | (\(  0.34\))    | (\(  0.32\))  |
| | durables | \(  0.29\)^{*}  | \( -0.00\)  | \(  0.22\)  | \(  0.00\)  | \(  0.29\)^{*}  | \( -0.00\)  |
 |  | $N=227$  | (\(  0.17\))    | (\(  0.00\))    | (\(  0.19\))    | (\(  0.00\))    | (\(  0.17\))    | (\(  0.00\))  |
| | fan | \( -0.37\)  | \( -0.34\)  | \(  0.20\)  | \( -0.61\)  | \(  0.23\)  | \(  0.27\)  |
 |  | $N=48$  | (\(   inf\))    | (\(   inf\))    | (\(   inf\))    | (\(   inf\))    | (\(   inf\))    | (\(   inf\))  |
| | farm_income_yearly_sum | \(  0.00\)  | \( -0.17\)  | \(  0.00\)^{***}  | \( -0.05\)  | \(  0.05\)  | \( -0.12\)  |
 |  | $N=540$  | (\(  0.00\))    | (\(  0.12\))    | (\(  0.00\))    | (\(  0.16\))    | (\(  0.16\))    | (\(  0.20\))  |
| | funerals | \(  0.64\)^{***}  | \( -0.46\)^{*}  | \(  0.50\)^{*}  | \(  0.03\)  | \(  0.61\)  | \( -0.49\)  |
 |  | $N=570$  | (\(  0.24\))    | (\(  0.25\))    | (\(  0.29\))    | (\(  0.29\))    | (\(  0.38\))    | (\(  0.39\))  |
| | homeimprovement | \(  0.52\)^{***}  | \(  0.32\)  | \(  0.15\)  | \( -0.22\)  | \(  0.74\)^{*}  | \(  0.54\)  |
 |  | $N=230$  | (\(  0.20\))    | (\(  0.32\))    | (\(  0.37\))    | (\(  0.39\))    | (\(  0.44\))    | (\(  0.50\))  |
| | land_communitycult | \(  0.40\)  | \(  0.28\)  | \( -0.00\)  | \(  0.53\)  | \( -0.13\)  | \( -0.25\)  |
 |  | $N=49$  | (\(  0.86\))    | (\(  0.43\))    | (\(  0.00\))    | (\(  0.47\))    | (\(  0.98\))    | (\(  0.63\))  |
| | land_owncult | \(  0.12\)  | \(  0.05\)  | \( -0.18\)^{*}  | \(  0.20\)^{**}  | \( -0.09\)  | \( -0.15\)  |
 |  | $N=1012$  | (\(  0.08\))    | (\(  0.08\))    | (\(  0.11\))    | (\(  0.09\))    | (\(  0.12\))    | (\(  0.12\))  |
| | land_ownnocult | \(  0.41\)^{**}  | \(  0.02\)  | \(  0.12\)  | \(  0.17\)  | \(  0.23\)  | \( -0.16\)  |
 |  | $N=301$  | (\(  0.16\))    | (\(  0.10\))    | (\(  0.24\))    | (\(  0.11\))    | (\(  0.19\))    | (\(  0.14\))  |
| | land_ownrent | \( -0.59\)  | \( -0.01\)  | \( -0.00\)  | \( -0.22\)  | \( -0.36\)  | \(  0.22\)  |
 |  | $N=21$  | (\(  0.63\))    | (\(  0.83\))    | (\(  0.00\))    | (\(  0.94\))    | (\(  1.13\))    | (\(  1.25\))  |
| | land_rentcult | \( -0.04\)  | \(  1.01\)  | \( -1.00\)  | \(  0.54\)  | \( -0.58\)  | \(  0.47\)  |
 |  | $N=23$  | (\(  1.01\))    | (\(  1.01\))    | (\(  1.31\))    | (\(  1.23\))    | (\(  1.59\))    | (\(  1.59\))  |
| | livestock | \( -0.09\)  | \(  0.10\)  | \(  0.06\)  | \(  0.12\)  | \( -0.21\)  | \( -0.01\)  |
 |  | $N=316$  | (\(  0.13\))    | (\(  0.11\))    | (\(  0.12\))    | (\(  0.11\))    | (\(  0.17\))    | (\(  0.16\))  |
| | livestock_income_yearly_sum | \(  0.00\)  | \(  0.43\)^{***}  | \( -0.00\)^{***}  | \( -0.19\)  | \(  0.19\)  | \(  0.62\)^{**}  |
 |  | $N=314$  | (\(  0.00\))    | (\(  0.16\))    | (\(  0.00\))    | (\(  0.22\))    | (\(  0.22\))    | (\(  0.27\))  |
| | maize | \(  0.16\)^{*}  | \( -0.09\)  | \( -0.30\)^{**}  | \(  0.02\)  | \(  0.14\)  | \( -0.11\)  |
 |  | $N=523$  | (\(  0.09\))    | (\(  0.11\))    | (\(  0.15\))    | (\(  0.14\))    | (\(  0.17\))    | (\(  0.18\))  |
| | medicine | \(  0.35\)^{***}  | \(  0.26\)^{**}  | \(  0.22\)  | \(  0.41\)^{***}  | \( -0.06\)  | \( -0.16\)  |
 |  | $N=1152$  | (\(  0.11\))    | (\(  0.10\))    | (\(  0.14\))    | (\(  0.13\))    | (\(  0.17\))    | (\(  0.17\))  |
| | millet | \(  0.15\)  | \( -0.15\)  | \( -0.13\)  | \( -0.34\)  | \(  0.49\)  | \(  0.19\)  |
 |  | $N=101$  | (\(  0.20\))    | (\(  0.21\))    | (\(  0.30\))    | (\(  0.43\))    | (\(  0.47\))    | (\(  0.48\))  |
| | nuts | \(  0.13\)^{**}  | \( -0.04\)  | \( -0.16\)^{**}  | \(  0.05\)  | \(  0.08\)  | \( -0.08\)  |
 |  | $N=908$  | (\(  0.06\))    | (\(  0.06\))    | (\(  0.07\))    | (\(  0.07\))    | (\(  0.09\))    | (\(  0.10\))  |
| | othermonth | \(  0.89\)  | \(  0.61\)  | \(  0.31\)  | \(  0.12\)  | \(  0.78\)  | \(  0.50\)  |
 |  | $N=30$  | (\(   inf\))    | (\(   inf\))    | (\(   inf\))    | (\(   inf\))    | (\(   inf\))    | (\(   inf\))  |
| | pangas | \(  0.02\)  | \(  0.14\)^{**}  | \(  0.03\)  | \(  0.00\)  | \(  0.02\)  | \(  0.14\)  |
 |  | $N=748$  | (\(  0.08\))    | (\(  0.07\))    | (\(  0.10\))    | (\(  0.09\))    | (\(  0.12\))    | (\(  0.11\))  |
| | plough | \( -0.22\)  | \(  0.10\)  | \(  0.51\)  | \( -0.42\)  | \(  0.20\)  | \(  0.52\)  |
 |  | $N=32$  |     |     |     |     |     |   |
| | ploughs_again | \( -0.28\)  | \(  0.00\)  | \( -0.28\)  | \(  0.00\)  | \( -0.28\)  | \(  0.00\)  |
 |  | $N=12$  | (\(  0.43\))    | (\(  0.00\))    | (\(  0.80\))    | (\(  0.00\))    | (\(  0.43\))    | (\(  0.00\))  |
| | potato | \(  0.31\)  | \( -0.06\)  | \(  0.29\)  | \(  0.24\)  | \(  0.07\)  | \( -0.31\)  |
 |  | $N=40$  | (\(  0.20\))    | (\(  0.42\))    | (\(  0.31\))    | (\(  0.18\))    | (\(  0.27\))    | (\(  0.45\))  |
| | potspans | \( -0.06\)  | \(  0.10\)  | \(  0.05\)  | \( -0.19\)  | \(  0.13\)  | \(  0.29\)^{*}  |
 |  | $N=1034$  | (\(  0.13\))    | (\(  0.10\))    | (\(  0.16\))    | (\(  0.12\))    | (\(  0.18\))    | (\(  0.15\))  |
| | rice | \(  0.06\)  | \(  0.13\)^{*}  | \( -0.05\)  | \(  0.15\)^{**}  | \( -0.09\)  | \( -0.02\)  |
 |  | $N=821$  | (\(  0.06\))    | (\(  0.07\))    | (\(  0.07\))    | (\(  0.07\))    | (\(  0.09\))    | (\(  0.10\))  |
| | savings_BRAC | \( -0.25\)^{**}  | \( -0.08\)  | \(  1.78\)  | \(  0.04\)  | \( -0.29\)  | \( -0.12\)  |
 |  | $N=240$  | (\(  0.13\))    | (\(  0.18\))    | (\(  1.12\))    | (\(  0.25\))    | (\(  0.28\))    | (\(  0.31\))  |
| | savings_NGOs | \(  0.00\)  | \(  0.35\)^{***}  | \(  0.00\)  | \(  0.00\)  | \(  0.00\)  | \(  0.35\)^{***}  |
 |  | $N=1$  | (\(  0.00\))    | (\(  0.12\))    | (\(  0.00\))    | (\(  0.00\))    | (\(  0.00\))    | (\(  0.12\))  |
| | savings_bank | \(  0.92\)  | \(  7.88\)^{***}  | \( -0.00\)  | \(  5.05\)^{**}  | \( -4.13\)  | \(  2.83\)  |
 |  | $N=12$  | (\(  5.00\))    | (\(  2.85\))    | (\(  0.00\))    | (\(  2.50\))    | (\(  5.59\))    | (\(  3.79\))  |
| | savings_home | \(  0.26\)  | \(  0.38\)^{**}  | \(  0.07\)  | \(  0.46\)^{**}  | \( -0.20\)  | \( -0.08\)  |
 |  | $N=481$  | (\(  0.20\))    | (\(  0.18\))    | (\(  0.25\))    | (\(  0.23\))    | (\(  0.31\))    | (\(  0.29\))  |
| | savings_maize_val | \(  0.16\)  | \(  0.04\)  | \( -0.05\)  | \(  0.02\)  | \(  0.14\)  | \(  0.02\)  |
 |  | $N=354$  | (\(  0.13\))    | (\(  0.22\))    | (\(  0.16\))    | (\(  0.22\))    | (\(  0.26\))    | (\(  0.31\))  |
| | savings_other | \( -0.00\)  | \(  0.42\)  | \(  0.00\)  | \(  1.48\)  | \( -1.48\)  | \( -1.06\)  |
 |  | $N=31$  |     |     |     |     |     |   |
| | savings_otherfood1_val | \(  0.30\)^{**}  | \(  0.03\)  | \( -0.01\)  | \(  0.23\)^{*}  | \(  0.07\)  | \( -0.20\)  |
 |  | $N=630$  | (\(  0.15\))    | (\(  0.10\))    | (\(  0.18\))    | (\(  0.13\))    | (\(  0.20\))    | (\(  0.17\))  |
| | savings_otherfood2_val | \(  0.62\)  | \( -1.13\)  | \(  2.09\)^{***}  | \(  0.64\)  | \( -0.01\)  | \( -1.77\)  |
 |  | $N=31$  | (\(  0.75\))    | (\(  1.05\))    | (\(  0.63\))    | (\(  2.41\))    | (\(  2.52\))    | (\(  2.62\))  |
| | savings_sorghum_val | \(  0.06\)  | \( -0.05\)  | \( -0.25\)^{*}  | \( -0.07\)  | \(  0.13\)  | \(  0.02\)  |
 |  | $N=342$  | (\(  0.13\))    | (\(  0.22\))    | (\(  0.13\))    | (\(  0.18\))    | (\(  0.22\))    | (\(  0.29\))  |
| | sewing | \( -0.64\)  | \( -0.26\)  | \(  0.96\)  | \( -1.36\)  | \(  0.71\)  | \(  1.10\)  |
 |  | $N=73$  | (\(  0.50\))    | (\(  1.17\))    | (\(  1.34\))    | (\(  1.45\))    | (\(  1.53\))    | (\(  1.86\))  |
| | shed | \(  0.35\)  | \(  0.48\)  | \(  0.50\)  | \( -0.52\)  | \(  0.87\)  | \(  1.00\)  |
 |  | $N=111$  | (\(  0.30\))    | (\(  0.42\))    | (\(  0.48\))    | (\(  0.68\))    | (\(  0.75\))    | (\(  0.80\))  |
| | shoes | \(  0.29\)^{***}  | \( -0.19\)^{**}  | \( -0.25\)^{*}  | \( -0.23\)^{*}  | \(  0.52\)^{***}  | \(  0.04\)  |
 |  | $N=1109$  | (\(  0.11\))    | (\(  0.10\))    | (\(  0.14\))    | (\(  0.13\))    | (\(  0.17\))    | (\(  0.16\))  |
| | shop | \(  0.02\)  | \(  0.52\)  | \(  1.33\)^{*}  | \( -0.15\)  | \(  0.16\)  | \(  0.67\)  |
 |  | $N=67$  | (\(  0.67\))    | (\(  0.82\))    | (\(  0.72\))    | (\(  1.11\))    | (\(  1.29\))    | (\(  1.38\))  |
| | sorghum | \(  0.11\)  | \( -0.20\)^{*}  | \(  0.02\)  | \( -0.18\)  | \(  0.28\)  | \( -0.03\)  |
 |  | $N=409$  | (\(  0.09\))    | (\(  0.11\))    | (\(  0.10\))    | (\(  0.16\))    | (\(  0.18\))    | (\(  0.19\))  |
| | source1 | \(  0.00\)  | \( -0.07\)  | \( -0.00\)^{***}  | \( -0.30\)^{*}  | \(  0.30\)^{*}  | \(  0.23\)  |
 |  | $N=554$  | (\(  0.00\))    | (\(  0.12\))    | (\(  0.00\))    | (\(  0.18\))    | (\(  0.18\))    | (\(  0.21\))  |
| | source2 | \(  0.00\)  | \(  0.01\)  | \(  0.00\)  | \(  0.01\)  | \( -0.01\)  | \(  0.00\)  |
 |  | $N=191$  | (\(  0.00\))    | (\(  0.25\))    | (\(  0.00\))    | (\(  0.26\))    | (\(  0.26\))    | (\(  0.36\))  |
| | source3 | \(  0.00\)  | \(  0.90\)^{*}  | \( -0.00\)  | \(  0.81\)  | \( -0.81\)  | \(  0.09\)  |
 |  | $N=28$  | (\(  0.00\))    | (\(  0.51\))    | (\(  0.00\))    | (\(  1.85\))    | (\(  1.85\))    | (\(  1.92\))  |
| | source4 | \(  0.00\)  | \( -0.10\)  | \( -0.00\)  | \(  0.00\)  | \(  0.00\)  | \( -0.10\)  |
 |  | $N=9$  | (\(  0.00\))    | (\(  3.38\))    | (\(  0.00\))    | (\(  0.00\))    | (\(  0.00\))    | (\(  3.38\))  |
| | source5 | \( -0.00\)  | \(  2.08\)  | \(  0.00\)  | \(  0.00\)  | \( -0.00\)  | \(  2.08\)  |
 |  | $N=2$  | (\(  0.00\))    | (\(  6.40\))    | (\(  0.00\))    | (\(  0.00\))    | (\(  0.00\))    | (\(  6.40\))  |
| | stoves | \(  0.27\)^{*}  | \(  0.44\)  | \( -0.28\)^{*}  | \(  0.17\)  | \(  0.10\)  | \(  0.26\)  |
 |  | $N=277$  | (\(  0.16\))    | (\(  0.27\))    | (\(  0.16\))    | (\(  0.43\))    | (\(  0.46\))    | (\(  0.50\))  |
| | sweetpotato | \( -0.19\)  | \( -0.09\)  | \(  0.38\)  | \(  0.09\)  | \( -0.29\)  | \( -0.18\)  |
 |  | $N=79$  | (\(  0.16\))    | (\(  0.13\))    | (\(  0.24\))    | (\(  0.20\))    | (\(  0.26\))    | (\(  0.24\))  |
| | tea | \( -0.01\)  | \(  0.07\)  | \( -0.10\)  | \(  0.19\)^{*}  | \( -0.20\)  | \( -0.12\)  |
 |  | $N=919$  | (\(  0.06\))    | (\(  0.09\))    | (\(  0.07\))    | (\(  0.11\))    | (\(  0.13\))    | (\(  0.14\))  |
| | tobacco | \( -0.06\)  | \(  0.05\)  | \( -0.06\)  | \(  0.99\)  | \( -1.06\)  | \( -0.94\)  |
 |  | $N=73$  | (\(  0.40\))    | (\(  0.49\))    | (\(  0.58\))    | (\(  1.22\))    | (\(  1.29\))    | (\(  1.32\))  |
| | transfers_give1 | \(  0.49\)  | \( -0.23\)  | \( -0.47\)  | \( -0.04\)  | \(  0.53\)  | \( -0.19\)  |
 |  | $N=159$  | (\(  0.32\))    | (\(  0.26\))    | (\(  0.41\))    | (\(  0.50\))    | (\(  0.59\))    | (\(  0.56\))  |
| | transfers_give2 | \(  1.47\)^{*}  | \(  1.17\)  | \( -0.56\)  | \(  3.60\)  | \( -2.13\)  | \( -2.43\)  |
 |  | $N=25$  | (\(  0.86\))    | (\(  2.05\))    | (\(  1.48\))    | (\(  5.40\))    | (\(  5.47\))    | (\(  5.78\))  |
| | transfers_give3 | \(  0.00\)  | \(  0.00\)  | \(  0.00\)  | \(  0.00\)  | \(  0.00\)  | \(  0.00\)  |
 |  | $N=3$  |     |     |     |     |     |   |
| | tv | \(  0.28\)  | \(  0.28\)  | \( -0.20\)  | \(  0.78\)^{*}  | \( -0.50\)  | \( -0.50\)  |
 |  | $N=77$  | (\(  0.57\))    | (\(  0.38\))    | (\(  1.47\))    | (\(  0.45\))    | (\(  0.73\))    | (\(  0.59\))  |
| | womensclothes | \(  0.24\)^{**}  | \(  0.20\)^{*}  | \( -0.18\)  | \( -0.10\)  | \(  0.34\)^{*}  | \(  0.29\)^{*}  |
 |  | $N=803$  | (\(  0.11\))    | (\(  0.11\))    | (\(  0.14\))    | (\(  0.14\))    | (\(  0.18\))    | (\(  0.18\))  |

#+name: tab:post
#+caption: POST analysis of all variables
#+attr_latex: :environment longtable :align rrrrr



